/*
#############################################################################################
# Dishonered (DSDK) SDK 1.0.0.0
# Generated with the CodeRedGenerator v1.1.3
# ========================================================================================= #
# File: Core_parameters.hpp
# ========================================================================================= #
# Credits: ItsBranK, TheFeckless
# Links: www.github.com/CodeRedModding/CodeRed-Generator
#############################################################################################
*/
#pragma once

/*
# ========================================================================================= #
# Parameters
# ========================================================================================= #
*/

// Function Core.Object.GetBuildChangelistNumber
// [0x00020401]  (iNative[14510])
struct UObject_execGetBuildChangelistNumber_Params
{
	int32_t                                            ReturnValue;                                      // 0x0000 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.GetEngineVersion
// [0x00020401]  (iNative[14512])
struct UObject_execGetEngineVersion_Params
{
	int32_t                                            ReturnValue;                                      // 0x0000 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.GetSystemTime
// [0x00420401]  (iNative[14522])
struct UObject_execGetSystemTime_Params
{
	int32_t                                            Year;                                             // 0x0000 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	int32_t                                            Month;                                            // 0x0004 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	int32_t                                            DayOfWeek;                                        // 0x0008 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	int32_t                                            Day;                                              // 0x000C (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	int32_t                                            Hour;                                             // 0x0010 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	int32_t                                            Min;                                              // 0x0014 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	int32_t                                            Sec;                                              // 0x0018 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	int32_t                                            MSec;                                             // 0x001C (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
};

// Function Core.Object.TimeStamp
// [0x00020401]  (iNative[14825])
struct UObject_execTimeStamp_Params
{
	class FString                                      ReturnValue;                                      // 0x0000 (0x000C) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function Core.Object.TransformVectorByRotation
// [0x00024401]  (iNative[14831])
struct UObject_execTransformVectorByRotation_Params
{
	struct FRotator                                    SourceRotation;                                   // 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     SourceVector;                                     // 0x000C (0x000C) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bInverse : 1;                                     // 0x0018 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	struct FVector                                     ReturnValue;                                      // 0x001C (0x000C) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.GetPackageName
// [0x00020003] 
struct UObject_execGetPackageName_Params
{
	class FName                                        ReturnValue;                                      // 0x0000 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// class UObject*                                  O;                                                // 0x0008 (0x0004) [0x0000000000000000]               
};

// Function Core.Object.IsPendingKill
// [0x00020401]  (iNative[14584])
struct UObject_execIsPendingKill_Params
{
	bool                                               ReturnValue : 1;                                  // 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.GetAngularFromDotDist
// [0x00422401]  (iNative[14508])
struct UObject_execGetAngularFromDotDist_Params
{
	struct FVector2D                                   OutAngDist;                                       // 0x0000 (0x0008) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	struct FVector2D                                   DotDist;                                          // 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function Core.Object.GetAngularDistance
// [0x00422401]  (iNative[14507])
struct UObject_execGetAngularDistance_Params
{
	struct FVector2D                                   OutAngularDist;                                   // 0x0000 (0x0008) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	struct FVector                                     Direction;                                        // 0x0008 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     AxisX;                                            // 0x0014 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     AxisY;                                            // 0x0020 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     AxisZ;                                            // 0x002C (0x000C) [0x0000000000000080] (CPF_Parm)    
	bool                                               ReturnValue : 1;                                  // 0x0038 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.GetDotDistance
// [0x00422401]  (iNative[14511])
struct UObject_execGetDotDistance_Params
{
	struct FVector2D                                   OutDotDist;                                       // 0x0000 (0x0008) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	struct FVector                                     Direction;                                        // 0x0008 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     AxisX;                                            // 0x0014 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     AxisY;                                            // 0x0020 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     AxisZ;                                            // 0x002C (0x000C) [0x0000000000000080] (CPF_Parm)    
	bool                                               ReturnValue : 1;                                  // 0x0038 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.PointProjectToPlane
// [0x00022401]  (iNative[14718])
struct UObject_execPointProjectToPlane_Params
{
	struct FVector                                     Point;                                            // 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     A;                                                // 0x000C (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     B;                                                // 0x0018 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     C;                                                // 0x0024 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     ReturnValue;                                      // 0x0030 (0x000C) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.PointDistToSegment
// [0x00424401]  (iNative[14717])
struct UObject_execPointDistToSegment_Params
{
	struct FVector                                     Point;                                            // 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     StartPoint;                                       // 0x000C (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     EndPoint;                                         // 0x0018 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     OutClosestPoint;                                  // 0x0024 (0x000C) [0x0000000000000190] (CPF_OptionalParm | CPF_Parm | CPF_OutParm)
	float                                              ReturnValue;                                      // 0x0030 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.PointDistToLine
// [0x00424401]  (iNative[14716])
struct UObject_execPointDistToLine_Params
{
	struct FVector                                     Point;                                            // 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     Line;                                             // 0x000C (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     Origin;                                           // 0x0018 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     OutClosestPoint;                                  // 0x0024 (0x000C) [0x0000000000000190] (CPF_OptionalParm | CPF_Parm | CPF_OutParm)
	float                                              ReturnValue;                                      // 0x0030 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.GetPerObjectConfigSections
// [0x00426401]  (iNative[14518])
struct UObject_execGetPerObjectConfigSections_Params
{
	class UObject*                                     SearchClass;                                      // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class TArray<class FString>                        out_SectionNames;                                 // 0x0004 (0x000C) [0x0000000000400180] (CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	class UObject*                                     ObjectOuter;                                      // 0x0010 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	int32_t                                            MaxResults;                                       // 0x0014 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	bool                                               ReturnValue : 1;                                  // 0x0018 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.StaticSaveConfig
// [0x00022401]  (iNative[14780])
struct UObject_execStaticSaveConfig_Params
{
};

// Function Core.Object.SaveConfig
// [0x21800020401]  (iNative[6316])
struct UObject_execSaveConfig_Params
{
};

// Function Core.Object.FindObject
// [0x00022401]  (iNative[14493])
struct UObject_execFindObject_Params
{
	class FString                                      ObjectName;                                       // 0x0000 (0x000C) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class UObject*                                     ObjectClass;                                      // 0x000C (0x0004) [0x0000000000000080] (CPF_Parm)    
	class UObject*                                     ReturnValue;                                      // 0x0010 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.DynamicLoadObject
// [0x00026401]  (iNative[14450])
struct UObject_execDynamicLoadObject_Params
{
	class FString                                      ObjectName;                                       // 0x0000 (0x000C) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class UObject*                                     ObjectClass;                                      // 0x000C (0x0004) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           MayFail : 1;                                      // 0x0010 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	class UObject*                                     ReturnValue;                                      // 0x0014 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.GetEnum
// [0x00022401]  (iNative[14513])
struct UObject_execGetEnum_Params
{
	class UObject*                                     E;                                                // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            I;                                                // 0x0004 (0x0004) [0x0000000000000880] (CPF_Parm | CPF_CoerceParm)
	class FName                                        ReturnValue;                                      // 0x0008 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.Disable
// [0x7600020401]  (iNative[3917])
struct UObject_execDisable_Params
{
	class FName                                        ProbeFunc;                                        // 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function Core.Object.Enable
// [0x7500020401]  (iNative[3916])
struct UObject_execEnable_Params
{
	class FName                                        ProbeFunc;                                        // 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function Core.Object.ContinuedState
// [0x00020800] 
struct UObject_eventContinuedState_Params
{
};

// Function Core.Object.PausedState
// [0x00020800] 
struct UObject_eventPausedState_Params
{
};

// Function Core.Object.PoppedState
// [0x00020800] 
struct UObject_eventPoppedState_Params
{
};

// Function Core.Object.PushedState
// [0x00020800] 
struct UObject_eventPushedState_Params
{
};

// Function Core.Object.EndState
// [0x00020800] 
struct UObject_eventEndState_Params
{
	class FName                                        NextStateName;                                    // 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function Core.Object.BeginState
// [0x00020800] 
struct UObject_eventBeginState_Params
{
	class FName                                        PreviousStateName;                                // 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function Core.Object.DumpStateStack
// [0x00020401]  (iNative[14449])
struct UObject_execDumpStateStack_Params
{
};

// Function Core.Object.PopState
// [0x00024401]  (iNative[14720])
struct UObject_execPopState_Params
{
	uint32_t                                           bPopAll : 1;                                      // 0x0000 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
};

// Function Core.Object.PushState
// [0x00024401]  (iNative[14725])
struct UObject_execPushState_Params
{
	class FName                                        NewState;                                         // 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class FName                                        NewLabel;                                         // 0x0008 (0x0008) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
};

// Function Core.Object.GetStateName
// [0x11C00020401]  (iNative[14521])
struct UObject_execGetStateName_Params
{
	class FName                                        ReturnValue;                                      // 0x0000 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.IsChildState
// [0x00020401]  (iNative[14580])
struct UObject_execIsChildState_Params
{
	class FName                                        TestState;                                        // 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class FName                                        TestParentState;                                  // 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
	bool                                               ReturnValue : 1;                                  // 0x0010 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.IsInState
// [0x11900024401]  (iNative[14583])
struct UObject_execIsInState_Params
{
	class FName                                        TestState;                                        // 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bTestStateStack : 1;                              // 0x0008 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	bool                                               ReturnValue : 1;                                  // 0x000C (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.GotoState
// [0x7100024401]  (iNative[14525])
struct UObject_execGotoState_Params
{
	class FName                                        NewState;                                         // 0x0000 (0x0008) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	class FName                                        Label;                                            // 0x0008 (0x0008) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	uint32_t                                           bForceEvents : 1;                                 // 0x0010 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	uint32_t                                           bKeepStack : 1;                                   // 0x0014 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
};

// Function Core.Object.IsUTracing
// [0x00022401]  (iNative[14586])
struct UObject_execIsUTracing_Params
{
	bool                                               ReturnValue : 1;                                  // 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.SetUTracing
// [0x00022401]  (iNative[14766])
struct UObject_execSetUTracing_Params
{
	uint32_t                                           bShouldUTrace : 1;                                // 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function Core.Object.GetFuncName
// [0x00022401]  (iNative[14515])
struct UObject_execGetFuncName_Params
{
	class FName                                        ReturnValue;                                      // 0x0000 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.DebugBreak
// [0x00026401]  (iNative[14421])
struct UObject_execDebugBreak_Params
{
	int32_t                                            UserFlags;                                        // 0x0000 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	uint8_t                                            DebuggerType;                                     // 0x0004 (0x0001) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
};

// Function Core.Object.ScriptTrace
// [0x00022401]  (iNative[14760])
struct UObject_execScriptTrace_Params
{
};

// Function Core.Object.Localize
// [0x00022400]  (iNative[14608])
struct UObject_execLocalize_Params
{
	class FString                                      SectionName;                                      // 0x0000 (0x000C) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      KeyName;                                          // 0x000C (0x000C) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      PackageName;                                      // 0x0018 (0x000C) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      ReturnValue;                                      // 0x0024 (0x000C) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function Core.Object.WarnInternal
// [0xE800042401]  (iNative[14862])
struct UObject_execWarnInternal_Params
{
	class FString                                      S;                                                // 0x0000 (0x000C) [0x0000000000400880] (CPF_Parm | CPF_CoerceParm | CPF_NeedCtorLink)
};

// Function Core.Object.LogInternal
// [0xE700046401]  (iNative[14612])
struct UObject_execLogInternal_Params
{
	class FString                                      S;                                                // 0x0000 (0x000C) [0x0000000000400880] (CPF_Parm | CPF_CoerceParm | CPF_NeedCtorLink)
	class FName                                        Tag;                                              // 0x000C (0x0008) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
};

// Function Core.Object.Subtract_LinearColorLinearColor
// [0x00023003] 
struct UObject_execSubtract_LinearColorLinearColor_Params
{
	struct FLinearColor                                A;                                                // 0x0000 (0x0010) [0x0000000000000080] (CPF_Parm)    
	struct FLinearColor                                B;                                                // 0x0010 (0x0010) [0x0000000000000080] (CPF_Parm)    
	struct FLinearColor                                ReturnValue;                                      // 0x0020 (0x0010) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.Multiply_LinearColorFloat
// [0x00023003] 
struct UObject_execMultiply_LinearColorFloat_Params
{
	struct FLinearColor                                LC;                                               // 0x0000 (0x0010) [0x0000000000000080] (CPF_Parm)    
	float                                              Mult;                                             // 0x0010 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FLinearColor                                ReturnValue;                                      // 0x0014 (0x0010) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.ColorToLinearColor
// [0x00022003] 
struct UObject_execColorToLinearColor_Params
{
	struct FColor                                      OldColor;                                         // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FLinearColor                                ReturnValue;                                      // 0x0004 (0x0010) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.MakeLinearColor
// [0x00822003] 
struct UObject_execMakeLinearColor_Params
{
	float                                              R;                                                // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              G;                                                // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              B;                                                // 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              A;                                                // 0x000C (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FLinearColor                                ReturnValue;                                      // 0x0010 (0x0010) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// struct FLinearColor                             LC;                                               // 0x0020 (0x0010) [0x0000000000000000]               
};

// Function Core.Object.MakeColor
// [0x00826003] 
struct UObject_execMakeColor_Params
{
	uint8_t                                            R;                                                // 0x0000 (0x0001) [0x0000000000000080] (CPF_Parm)    
	uint8_t                                            G;                                                // 0x0001 (0x0001) [0x0000000000000080] (CPF_Parm)    
	uint8_t                                            B;                                                // 0x0002 (0x0001) [0x0000000000000080] (CPF_Parm)    
	uint8_t                                            A;                                                // 0x0003 (0x0001) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	struct FColor                                      ReturnValue;                                      // 0x0004 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// struct FColor                                   C;                                                // 0x0008 (0x0004) [0x0000000000000000]               
};

// Function Core.Object.Add_ColorColor
// [0x00023003] 
struct UObject_execAdd_ColorColor_Params
{
	struct FColor                                      A;                                                // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FColor                                      B;                                                // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FColor                                      ReturnValue;                                      // 0x0008 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.Multiply_ColorFloat
// [0x00023003] 
struct UObject_execMultiply_ColorFloat_Params
{
	struct FColor                                      A;                                                // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              B;                                                // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FColor                                      ReturnValue;                                      // 0x0008 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.Multiply_FloatColor
// [0x00023003] 
struct UObject_execMultiply_FloatColor_Params
{
	float                                              A;                                                // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FColor                                      B;                                                // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FColor                                      ReturnValue;                                      // 0x0008 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.Subtract_ColorColor
// [0x00023003] 
struct UObject_execSubtract_ColorColor_Params
{
	struct FColor                                      A;                                                // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FColor                                      B;                                                // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FColor                                      ReturnValue;                                      // 0x0008 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.EvalInterpCurveVector2D
// [0x00020401]  (iNative[14485])
struct UObject_execEvalInterpCurveVector2D_Params
{
	struct FInterpCurveVector2D                        Vector2DCurve;                                    // 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	float                                              InVal;                                            // 0x0010 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector2D                                   ReturnValue;                                      // 0x0014 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.EvalInterpCurveVector
// [0x00020401]  (iNative[14484])
struct UObject_execEvalInterpCurveVector_Params
{
	struct FInterpCurveVector                          VectorCurve;                                      // 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	float                                              InVal;                                            // 0x0010 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     ReturnValue;                                      // 0x0014 (0x000C) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.EvalInterpCurveFloat
// [0x00020401]  (iNative[14483])
struct UObject_execEvalInterpCurveFloat_Params
{
	struct FInterpCurveFloat                           FloatCurve;                                       // 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	float                                              InVal;                                            // 0x0010 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              ReturnValue;                                      // 0x0014 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.GetMappedRangeValue
// [0x00022501]  (iNative[14516])
struct UObject_execGetMappedRangeValue_Params
{
	struct FVector2D                                   InputRange;                                       // 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FVector2D                                   OutputRange;                                      // 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
	float                                              Value;                                            // 0x0010 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              ReturnValue;                                      // 0x0014 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.GetRangePctByValue
// [0x00022103] 
struct UObject_execGetRangePctByValue_Params
{
	struct FVector2D                                   Range;                                            // 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	float                                              Value;                                            // 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              ReturnValue;                                      // 0x000C (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.GetRangeValueByPct
// [0x00022103] 
struct UObject_execGetRangeValueByPct_Params
{
	struct FVector2D                                   Range;                                            // 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	float                                              Pct;                                              // 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              ReturnValue;                                      // 0x000C (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.SubtractEqual_Vector2DVector2D
// [0x00423401]  (iNative[14273])
struct UObject_execSubtractEqual_Vector2DVector2D_Params
{
	struct FVector2D                                   A;                                                // 0x0000 (0x0008) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	struct FVector2D                                   B;                                                // 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FVector2D                                   ReturnValue;                                      // 0x0010 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.AddEqual_Vector2DVector2D
// [0x00423401]  (iNative[14270])
struct UObject_execAddEqual_Vector2DVector2D_Params
{
	struct FVector2D                                   A;                                                // 0x0000 (0x0008) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	struct FVector2D                                   B;                                                // 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FVector2D                                   ReturnValue;                                      // 0x0010 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.DivideEqual_Vector2DFloat
// [0x00423401]  (iNative[14274])
struct UObject_execDivideEqual_Vector2DFloat_Params
{
	struct FVector2D                                   A;                                                // 0x0000 (0x0008) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	float                                              B;                                                // 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector2D                                   ReturnValue;                                      // 0x000C (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.MultiplyEqual_Vector2DFloat
// [0x00423401]  (iNative[14267])
struct UObject_execMultiplyEqual_Vector2DFloat_Params
{
	struct FVector2D                                   A;                                                // 0x0000 (0x0008) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	float                                              B;                                                // 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector2D                                   ReturnValue;                                      // 0x000C (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.Divide_Vector2DFloat
// [0x00023401]  (iNative[3983])
struct UObject_execDivide_Vector2DFloat_Params
{
	struct FVector2D                                   A;                                                // 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	float                                              B;                                                // 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector2D                                   ReturnValue;                                      // 0x000C (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.Multiply_Vector2DFloat
// [0x00023401]  (iNative[14265])
struct UObject_execMultiply_Vector2DFloat_Params
{
	struct FVector2D                                   A;                                                // 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	float                                              B;                                                // 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector2D                                   ReturnValue;                                      // 0x000C (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.Subtract_Vector2DVector2D
// [0x00023401]  (iNative[14271])
struct UObject_execSubtract_Vector2DVector2D_Params
{
	struct FVector2D                                   A;                                                // 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FVector2D                                   B;                                                // 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FVector2D                                   ReturnValue;                                      // 0x0010 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.Add_Vector2DVector2D
// [0x00023401]  (iNative[14268])
struct UObject_execAdd_Vector2DVector2D_Params
{
	struct FVector2D                                   A;                                                // 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FVector2D                                   B;                                                // 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FVector2D                                   ReturnValue;                                      // 0x0010 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.Subtract_QuatQuat
// [0x10F00023401]  (iNative[14271])
struct UObject_execSubtract_QuatQuat_Params
{
	struct FQuat                                       A;                                                // 0x0000 (0x0010) [0x0000000000000080] (CPF_Parm)    
	struct FQuat                                       B;                                                // 0x0010 (0x0010) [0x0000000000000080] (CPF_Parm)    
	struct FQuat                                       ReturnValue;                                      // 0x0020 (0x0010) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.Add_QuatQuat
// [0x10E00023401]  (iNative[14268])
struct UObject_execAdd_QuatQuat_Params
{
	struct FQuat                                       A;                                                // 0x0000 (0x0010) [0x0000000000000080] (CPF_Parm)    
	struct FQuat                                       B;                                                // 0x0010 (0x0010) [0x0000000000000080] (CPF_Parm)    
	struct FQuat                                       ReturnValue;                                      // 0x0020 (0x0010) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.QuatSlerp
// [0x00026401]  (iNative[14733])
struct UObject_execQuatSlerp_Params
{
	struct FQuat                                       A;                                                // 0x0000 (0x0010) [0x0000000000000080] (CPF_Parm)    
	struct FQuat                                       B;                                                // 0x0010 (0x0010) [0x0000000000000080] (CPF_Parm)    
	float                                              Alpha;                                            // 0x0020 (0x0004) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bShortestPath : 1;                                // 0x0024 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	struct FQuat                                       ReturnValue;                                      // 0x0030 (0x0010) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.QuatToRotator
// [0x00022401]  (iNative[14734])
struct UObject_execQuatToRotator_Params
{
	struct FQuat                                       A;                                                // 0x0000 (0x0010) [0x0000000000000080] (CPF_Parm)    
	struct FRotator                                    ReturnValue;                                      // 0x0010 (0x000C) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.QuatFromRotator
// [0x00022401]  (iNative[14729])
struct UObject_execQuatFromRotator_Params
{
	struct FRotator                                    A;                                                // 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FQuat                                       ReturnValue;                                      // 0x0010 (0x0010) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.QuatFromAxisAndAngle
// [0x00022401]  (iNative[14728])
struct UObject_execQuatFromAxisAndAngle_Params
{
	struct FVector                                     Axis;                                             // 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	float                                              Angle;                                            // 0x000C (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FQuat                                       ReturnValue;                                      // 0x0010 (0x0010) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.QuatFindBetween
// [0x00022401]  (iNative[14727])
struct UObject_execQuatFindBetween_Params
{
	struct FVector                                     A;                                                // 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     B;                                                // 0x000C (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FQuat                                       ReturnValue;                                      // 0x0020 (0x0010) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.QuatRotateVector
// [0x00022401]  (iNative[14732])
struct UObject_execQuatRotateVector_Params
{
	struct FQuat                                       A;                                                // 0x0000 (0x0010) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     B;                                                // 0x0010 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     ReturnValue;                                      // 0x001C (0x000C) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.QuatInvert
// [0x00022401]  (iNative[14730])
struct UObject_execQuatInvert_Params
{
	struct FQuat                                       A;                                                // 0x0000 (0x0010) [0x0000000000000080] (CPF_Parm)    
	struct FQuat                                       ReturnValue;                                      // 0x0010 (0x0010) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.QuatDot
// [0x00022401]  (iNative[14726])
struct UObject_execQuatDot_Params
{
	struct FQuat                                       A;                                                // 0x0000 (0x0010) [0x0000000000000080] (CPF_Parm)    
	struct FQuat                                       B;                                                // 0x0010 (0x0010) [0x0000000000000080] (CPF_Parm)    
	float                                              ReturnValue;                                      // 0x0020 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.QuatProduct
// [0x00022401]  (iNative[14731])
struct UObject_execQuatProduct_Params
{
	struct FQuat                                       A;                                                // 0x0000 (0x0010) [0x0000000000000080] (CPF_Parm)    
	struct FQuat                                       B;                                                // 0x0010 (0x0010) [0x0000000000000080] (CPF_Parm)    
	struct FQuat                                       ReturnValue;                                      // 0x0020 (0x0010) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.MatrixGetAxis
// [0x00022401]  (iNative[14625])
struct UObject_execMatrixGetAxis_Params
{
	struct FMatrix                                     TM;                                               // 0x0000 (0x0040) [0x0000000000000080] (CPF_Parm)    
	uint8_t                                            Axis;                                             // 0x0040 (0x0001) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     ReturnValue;                                      // 0x0044 (0x000C) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.MatrixGetOrigin
// [0x00022401]  (iNative[14626])
struct UObject_execMatrixGetOrigin_Params
{
	struct FMatrix                                     TM;                                               // 0x0000 (0x0040) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     ReturnValue;                                      // 0x0040 (0x000C) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.MatrixGetRotator
// [0x00022401]  (iNative[14627])
struct UObject_execMatrixGetRotator_Params
{
	struct FMatrix                                     TM;                                               // 0x0000 (0x0040) [0x0000000000000080] (CPF_Parm)    
	struct FRotator                                    ReturnValue;                                      // 0x0040 (0x000C) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.MakeRotationMatrix
// [0x00022401]  (iNative[14621])
struct UObject_execMakeRotationMatrix_Params
{
	struct FRotator                                    Rotation;                                         // 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FMatrix                                     ReturnValue;                                      // 0x0010 (0x0040) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.MakeRotationTranslationMatrix
// [0x00022401]  (iNative[14622])
struct UObject_execMakeRotationTranslationMatrix_Params
{
	struct FVector                                     Translation;                                      // 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FRotator                                    Rotation;                                         // 0x000C (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FMatrix                                     ReturnValue;                                      // 0x0020 (0x0040) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.InverseTransformNormal
// [0x00022401]  (iNative[14577])
struct UObject_execInverseTransformNormal_Params
{
	struct FMatrix                                     TM;                                               // 0x0000 (0x0040) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     A;                                                // 0x0040 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     ReturnValue;                                      // 0x004C (0x000C) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.TransformNormal
// [0x00022401]  (iNative[14829])
struct UObject_execTransformNormal_Params
{
	struct FMatrix                                     TM;                                               // 0x0000 (0x0040) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     A;                                                // 0x0040 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     ReturnValue;                                      // 0x004C (0x000C) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.InverseTransformVector
// [0x00022401]  (iNative[14578])
struct UObject_execInverseTransformVector_Params
{
	struct FMatrix                                     TM;                                               // 0x0000 (0x0040) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     A;                                                // 0x0040 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     ReturnValue;                                      // 0x004C (0x000C) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.TransformVector
// [0x00022401]  (iNative[14830])
struct UObject_execTransformVector_Params
{
	struct FMatrix                                     TM;                                               // 0x0000 (0x0040) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     A;                                                // 0x0040 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     ReturnValue;                                      // 0x004C (0x000C) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.Multiply_MatrixMatrix
// [0x00023401]  (iNative[14265])
struct UObject_execMultiply_MatrixMatrix_Params
{
	struct FMatrix                                     A;                                                // 0x0000 (0x0040) [0x0000000000000080] (CPF_Parm)    
	struct FMatrix                                     B;                                                // 0x0040 (0x0040) [0x0000000000000080] (CPF_Parm)    
	struct FMatrix                                     ReturnValue;                                      // 0x0080 (0x0040) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.NotEqual_NameName
// [0xFF00023401]  (iNative[14259])
struct UObject_execNotEqual_NameName_Params
{
	class FName                                        A;                                                // 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class FName                                        B;                                                // 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
	bool                                               ReturnValue : 1;                                  // 0x0010 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.EqualEqual_NameName
// [0xFE00023401]  (iNative[14278])
struct UObject_execEqualEqual_NameName_Params
{
	class FName                                        A;                                                // 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class FName                                        B;                                                // 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
	bool                                               ReturnValue : 1;                                  // 0x0010 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.IsA
// [0xC500020401]  (iNative[14579])
struct UObject_execIsA_Params
{
	class FName                                        ClassName;                                        // 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	bool                                               ReturnValue : 1;                                  // 0x0008 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.ClassIsChildOf
// [0x10200022401]  (iNative[14401])
struct UObject_execClassIsChildOf_Params
{
	class UObject*                                     TestClass;                                        // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class UObject*                                     ParentClass;                                      // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	bool                                               ReturnValue : 1;                                  // 0x0008 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.NotEqual_InterfaceInterface
// [0x00023401]  (iNative[14259])
struct UObject_execNotEqual_InterfaceInterface_Params
{
	class UInterface*                                  A;                                                // 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UInterface*                                  B;                                                // 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
	bool                                               ReturnValue : 1;                                  // 0x0010 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.EqualEqual_InterfaceInterface
// [0x00023401]  (iNative[14278])
struct UObject_execEqualEqual_InterfaceInterface_Params
{
	class UInterface*                                  A;                                                // 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UInterface*                                  B;                                                // 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
	bool                                               ReturnValue : 1;                                  // 0x0010 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.NotEqual_ObjectObject
// [0x7700023401]  (iNative[14259])
struct UObject_execNotEqual_ObjectObject_Params
{
	class UObject*                                     A;                                                // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class UObject*                                     B;                                                // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	bool                                               ReturnValue : 1;                                  // 0x0008 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.EqualEqual_ObjectObject
// [0x7200023401]  (iNative[14278])
struct UObject_execEqualEqual_ObjectObject_Params
{
	class UObject*                                     A;                                                // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class UObject*                                     B;                                                // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	bool                                               ReturnValue : 1;                                  // 0x0008 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.PathName
// [0x00022401]  (iNative[3958])
struct UObject_execPathName_Params
{
	class UObject*                                     CheckObject;                                      // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class FString                                      ReturnValue;                                      // 0x0004 (0x000C) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function Core.Object.ParseStringIntoArray
// [0x00422401]  (iNative[14710])
struct UObject_execParseStringIntoArray_Params
{
	class FString                                      BaseString;                                       // 0x0000 (0x000C) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class TArray<class FString>                        Pieces;                                           // 0x000C (0x000C) [0x0000000000400180] (CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	class FString                                      Delim;                                            // 0x0018 (0x000C) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	uint32_t                                           bCullEmpty : 1;                                   // 0x0024 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function Core.Object.Split
// [0x00026003] 
struct UObject_execSplit_Params
{
	class FString                                      Text;                                             // 0x0000 (0x000C) [0x0000000000400880] (CPF_Parm | CPF_CoerceParm | CPF_NeedCtorLink)
	class FString                                      SplitStr;                                         // 0x000C (0x000C) [0x0000000000400880] (CPF_Parm | CPF_CoerceParm | CPF_NeedCtorLink)
	uint32_t                                           bOmitSplitStr : 1;                                // 0x0018 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	class FString                                      ReturnValue;                                      // 0x001C (0x000C) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
	// int32_t                                         pos;                                              // 0x0028 (0x0004) [0x0000000000000000]               
};

// Function Core.Object.Repl
// [0xC900026401]  (iNative[14745])
struct UObject_execRepl_Params
{
	class FString                                      Src;                                              // 0x0000 (0x000C) [0x0000000000400880] (CPF_Parm | CPF_CoerceParm | CPF_NeedCtorLink)
	class FString                                      Match;                                            // 0x000C (0x000C) [0x0000000000400880] (CPF_Parm | CPF_CoerceParm | CPF_NeedCtorLink)
	class FString                                      With;                                             // 0x0018 (0x000C) [0x0000000000400880] (CPF_Parm | CPF_CoerceParm | CPF_NeedCtorLink)
	uint32_t                                           bCaseSensitive : 1;                               // 0x0024 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	class FString                                      ReturnValue;                                      // 0x0028 (0x000C) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function Core.Object.Asc
// [0xED00022401]  (iNative[14332])
struct UObject_execAsc_Params
{
	class FString                                      S;                                                // 0x0000 (0x000C) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	int32_t                                            ReturnValue;                                      // 0x000C (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.Chr
// [0xEC00022401]  (iNative[14391])
struct UObject_execChr_Params
{
	int32_t                                            I;                                                // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class FString                                      ReturnValue;                                      // 0x0004 (0x000C) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function Core.Object.Locs
// [0xEE00022401]  (iNative[14610])
struct UObject_execLocs_Params
{
	class FString                                      S;                                                // 0x0000 (0x000C) [0x0000000000400880] (CPF_Parm | CPF_CoerceParm | CPF_NeedCtorLink)
	class FString                                      ReturnValue;                                      // 0x000C (0x000C) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function Core.Object.Caps
// [0xEB00022401]  (iNative[14389])
struct UObject_execCaps_Params
{
	class FString                                      S;                                                // 0x0000 (0x000C) [0x0000000000400880] (CPF_Parm | CPF_CoerceParm | CPF_NeedCtorLink)
	class FString                                      ReturnValue;                                      // 0x000C (0x000C) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function Core.Object.Right
// [0xEA00022401]  (iNative[14747])
struct UObject_execRight_Params
{
	class FString                                      S;                                                // 0x0000 (0x000C) [0x0000000000400880] (CPF_Parm | CPF_CoerceParm | CPF_NeedCtorLink)
	int32_t                                            I;                                                // 0x000C (0x0004) [0x0000000000000080] (CPF_Parm)    
