/*
#############################################################################################
# Dishonered (DSDK) SDK 1.0.0.0
# Generated with the CodeRedGenerator v1.1.3
# ========================================================================================= #
# File: DishonoredGame_parameters.hpp
# ========================================================================================= #
# Credits: ItsBranK, TheFeckless
# Links: www.github.com/CodeRedModding/CodeRed-Generator
#############################################################################################
*/
#pragma once

/*
# ========================================================================================= #
# Parameters
# ========================================================================================= #
*/

// Function DishonoredGame.DisCrusher.EncroachingOn
// [0x00020C00]  (iNative[314])
struct ADisCrusher_eventEncroachingOn_Params
{
	class AActor*                                      Other;                                            // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	bool                                               ReturnValue : 1;                                  // 0x0004 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function DishonoredGame.DishonoredAutoTestManager.DoSentinel_PerfAtSpecificLocation
// [0x00420400]  (iNative[19128])
struct ADishonoredAutoTestManager_execDoSentinel_PerfAtSpecificLocation_Params
{
	struct FVector                                     InLocation;                                       // 0x0000 (0x000C) [0x0000000000000182] (CPF_Const | CPF_Parm | CPF_OutParm)
	struct FRotator                                    InRotation;                                       // 0x000C (0x000C) [0x0000000000000182] (CPF_Const | CPF_Parm | CPF_OutParm)
};

// Function DishonoredGame.DishonoredAutoTestManager.DoSentinel_MemoryAtSpecificLocation
// [0x00020400]  (iNative[19127])
struct ADishonoredAutoTestManager_execDoSentinel_MemoryAtSpecificLocation_Params
{
	struct FVector                                     InLocation;                                       // 0x0000 (0x000C) [0x0000000000000082] (CPF_Const | CPF_Parm)
	struct FRotator                                    InRotation;                                       // 0x000C (0x000C) [0x0000000000000082] (CPF_Const | CPF_Parm)
};

// Function DishonoredGame.DishonoredAutoTestManager.GetTravelLocations
// [0x00420400]  (iNative[20796])
struct ADishonoredAutoTestManager_execGetTravelLocations_Params
{
	class FName                                        LevelName;                                        // 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class APlayerController*                           PC;                                               // 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class TArray<struct FVector>                       TravelPoints;                                     // 0x000C (0x000C) [0x0000000000400180] (CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
};

// Function DishonoredGame.DishonoredAutoTestManager.DoSentinelActionBeforeExit_Native
// [0x00020400]  (iNative[19130])
struct ADishonoredAutoTestManager_execDoSentinelActionBeforeExit_Native_Params
{
};

// Function DishonoredGame.DishonoredAutoTestManager.DoSentinelActionPerLoadedLevel_Native
// [0x00020400]  (iNative[19131])
struct ADishonoredAutoTestManager_execDoSentinelActionPerLoadedLevel_Native_Params
{
};

// Function DishonoredGame.DishonoredAutoTestManager.DoSentinelActionPerLoadedMap
// [0x00020400]  (iNative[19132])
struct ADishonoredAutoTestManager_execDoSentinelActionPerLoadedMap_Params
{
};

// Function DishonoredGame.DishonoredAutoTestManager.EndSentinelRun
// [0x00020400]  (iNative[19576])
struct ADishonoredAutoTestManager_execEndSentinelRun_Params
{
	uint8_t                                            RunResult;                                        // 0x0000 (0x0001) [0x0000000000000080] (CPF_Parm)    
};

// Function DishonoredGame.DishonoredAutoTestManager.BeginSentinelRun
// [0x00020400]  (iNative[16240])
struct ADishonoredAutoTestManager_execBeginSentinelRun_Params
{
	class FString                                      TaskDescription;                                  // 0x0000 (0x000C) [0x0000000000400082] (CPF_Const | CPF_Parm | CPF_NeedCtorLink)
	class FString                                      TaskParameter;                                    // 0x000C (0x000C) [0x0000000000400082] (CPF_Const | CPF_Parm | CPF_NeedCtorLink)
	class FString                                      TagDesc;                                          // 0x0018 (0x000C) [0x0000000000400082] (CPF_Const | CPF_Parm | CPF_NeedCtorLink)
};

// Function DishonoredGame.DishonoredDebugMenu.ToggleDebugMenu
// [0x00020400]  (iNative[45370])
struct UDishonoredDebugMenu_execToggleDebugMenu_Params
{
	class FString                                      _PageName;                                        // 0x0000 (0x000C) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
};

// Function DishonoredGame.DishonoredDebugMenu.LoadMenu
// [0x00020400]  (iNative[35768])
struct UDishonoredDebugMenu_execLoadMenu_Params
{
	class FString                                      _PageName;                                        // 0x0000 (0x000C) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
};

// Function DishonoredGame.DishonoredDebugMenu.HideMenu
// [0x00020400]  (iNative[35463])
struct UDishonoredDebugMenu_execHideMenu_Params
{
};

// Function DishonoredGame.DishonoredEmitterPool.SpawnEmitterMeshAttachment
// [0x00024400]  (iNative[26099])
struct ADishonoredEmitterPool_execSpawnEmitterMeshAttachment_Params
{
	class UParticleSystem*                             _pEmitterTemplate;                                // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class USkeletalMeshComponent*                      _pMesh;                                           // 0x0004 (0x0004) [0x0000000004000080] (CPF_Parm | CPF_EditInline)
	class FName                                        _AttachPointName;                                 // 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           _bAttachToSocket : 1;                             // 0x0010 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	struct FVector                                     _RelativeLoc;                                     // 0x0014 (0x000C) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	struct FRotator                                    _RelativeRot;                                     // 0x0020 (0x000C) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	class UParticleSystemComponent*                    ReturnValue;                                      // 0x002C (0x0004) [0x0000000004000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_EditInline)
};

// Function DishonoredGame.DishonoredEmitterPool.SpawnEmitter
// [0x00024400]  (iNative[26097])
struct ADishonoredEmitterPool_execSpawnEmitter_Params
{
	class UParticleSystem*                             _pEmitterTemplate;                                // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     _SpawnLocation;                                   // 0x0004 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FRotator                                    _SpawnRotation;                                   // 0x0010 (0x000C) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	class AActor*                                      _pAttachToActor;                                  // 0x001C (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	uint32_t                                           _bInheritScaleFromBase : 1;                       // 0x0020 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	class UParticleSystemComponent*                    ReturnValue;                                      // 0x0024 (0x0004) [0x0000000004000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_EditInline)
};

// Function DishonoredGame.DishonoredEngine.PublishRichPresence
// [0x00020401]  (iNative[44609])
struct UDishonoredEngine_execPublishRichPresence_Params
{
};

// Function DishonoredGame.DishonoredEngine.UpdateRichPresenceChaos
// [0x00020401]  (iNative[45648])
struct UDishonoredEngine_execUpdateRichPresenceChaos_Params
{
	int32_t                                            nCurrentRichPresenceChaos;                        // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function DishonoredGame.DishonoredEngine.UpdateRichPresenceChapter
// [0x00020401]  (iNative[45649])
struct UDishonoredEngine_execUpdateRichPresenceChapter_Params
{
	int32_t                                            nCurrentRichPresenceChapter;                      // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function DishonoredGame.DishonoredEngine.OpenContentUnavailableMenu
// [0x00020400]  (iNative[27392])
struct UDishonoredEngine_execOpenContentUnavailableMenu_Params
{
};

// Function DishonoredGame.DishonoredEngine.OpenControllerConnectionMenu
// [0x00020400]  (iNative[23688])
struct UDishonoredEngine_execOpenControllerConnectionMenu_Params
{
};

// Function DishonoredGame.DishonoredEngine.OnControllerDisconnected
// [0x00020400]  (iNative[23582])
struct UDishonoredEngine_execOnControllerDisconnected_Params
{
	int32_t                                            ControllerId;                                     // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function DishonoredGame.DishonoredEngine.OnControllerChanged
// [0x00020400]  (iNative[23581])
struct UDishonoredEngine_execOnControllerChanged_Params
{
	uint32_t                                           bIsConnected : 1;                                 // 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function DishonoredGame.DishonoredEngine.OpenPauseMenu
// [0x00020400]  (iNative[23691])
struct UDishonoredEngine_execOpenPauseMenu_Params
{
};

// Function DishonoredGame.DishonoredEngine.PlayLoadMapMovie
// [0x00020400]  (iNative[24342])
struct UDishonoredEngine_execPlayLoadMapMovie_Params
{
	class FString                                      _MapName;                                         // 0x0000 (0x000C) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      _MovieName;                                       // 0x000C (0x000C) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	bool                                               ReturnValue : 1;                                  // 0x0018 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function DishonoredGame.DishonoredEngine.PopIgnoreAutosave
// [0x00020600]  (iNative[44351])
struct UDishonoredEngine_execPopIgnoreAutosave_Params
{
	uint8_t                                            _Type;                                            // 0x0000 (0x0001) [0x0000000000000080] (CPF_Parm)    
};

// Function DishonoredGame.DishonoredEngine.PushIgnoreAutosave
// [0x00020600]  (iNative[44618])
struct UDishonoredEngine_execPushIgnoreAutosave_Params
{
	uint8_t                                            _Type;                                            // 0x0000 (0x0001) [0x0000000000000080] (CPF_Parm)    
};

// Function DishonoredGame.DishonoredEngine.PopDisableSave
// [0x00024600]  (iNative[44350])
struct UDishonoredEngine_execPopDisableSave_Params
{
	uint8_t                                            _DisableSaveType;                                 // 0x0000 (0x0001) [0x0000000000000080] (CPF_Parm)    
	float                                              _fWaitToEnable;                                   // 0x0004 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
};

// Function DishonoredGame.DishonoredEngine.PushDisableSave
// [0x00020600]  (iNative[44617])
struct UDishonoredEngine_execPushDisableSave_Params
{
	uint8_t                                            _DisableSaveType;                                 // 0x0000 (0x0001) [0x0000000000000080] (CPF_Parm)    
};

// Function DishonoredGame.DishonoredEngine.Dis_Load
// [0x00020600]  (iNative[31664])
struct UDishonoredEngine_execDis_Load_Params
{
	int32_t                                            _Slot;                                            // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function DishonoredGame.DishonoredEngine.Dis_Save
// [0x00020600]  (iNative[31673])
struct UDishonoredEngine_execDis_Save_Params
{
	int32_t                                            _Slot;                                            // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function DishonoredGame.DishonoredGameInfo.PreventDeath
// [0x00020802] 
struct ADishonoredGameInfo_eventPreventDeath_Params
{
	class APawn*                                       _pKilledPawn;                                     // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class AController*                                 _pKiller;                                         // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class UDamageType*                                 _pDamageType;                                     // 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     _HitLocation;                                     // 0x000C (0x000C) [0x0000000000000080] (CPF_Parm)    
	bool                                               ReturnValue : 1;                                  // 0x0018 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
	// uint32_t                                        bRet : 1;                                         // 0x001C (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function DishonoredGame.DishonoredGameInfo.PreventDeath_Native
// [0x00020400]  (iNative[44430])
struct ADishonoredGameInfo_execPreventDeath_Native_Params
{
	class APawn*                                       _pKilledPawn;                                     // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class AController*                                 _pKiller;                                         // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class UDamageType*                                 _pDamageType;                                     // 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     _HitLocation;                                     // 0x000C (0x000C) [0x0000000000000080] (CPF_Parm)    
	bool                                               ReturnValue : 1;                                  // 0x0018 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function DishonoredGame.DishonoredGameInfo.NotifyPathChanged
// [0x00020800] 
struct ADishonoredGameInfo_eventNotifyPathChanged_Params
{
};

// Function DishonoredGame.DishonoredGameInfo.StartMatch
// [0x00020802] 
struct ADishonoredGameInfo_eventStartMatch_Params
{
};

// Function DishonoredGame.DishonoredGameInfo.SpawnPlayer
// [0x00020400]  (iNative[26113])
struct ADishonoredGameInfo_execSpawnPlayer_Params
{
	class APawn*                                       _pSpawnClass;                                     // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     _SpawnLocation;                                   // 0x0004 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FRotator                                    _SpawnRotation;                                   // 0x0010 (0x000C) [0x0000000000000080] (CPF_Parm)    
	class APawn*                                       ReturnValue;                                      // 0x001C (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function DishonoredGame.DishonoredGameInfo.CanStartMatch
// [0x00020400]  (iNative[30806])
struct ADishonoredGameInfo_execCanStartMatch_Params
{
	bool                                               ReturnValue : 1;                                  // 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function DishonoredGame.DishonoredGameInfo.GameEnding
// [0x00020C00]  (iNative[13530])
struct ADishonoredGameInfo_eventGameEnding_Params
{
};

// Function DishonoredGame.DishonoredGameInfo.GetDishonoredEngineVersion
// [0x00022401]  (iNative[35317])
struct ADishonoredGameInfo_execGetDishonoredEngineVersion_Params
{
	int32_t                                            ReturnValue;                                      // 0x0000 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function DishonoredGame.DishonoredGameInfo.GetChangelist
// [0x00022401]  (iNative[35315])
struct ADishonoredGameInfo_execGetChangelist_Params
{
	int32_t                                            ReturnValue;                                      // 0x0000 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function DishonoredGame.DishonoredKActor.TakeDamage_Native
// [0x00024400]  (iNative[45311])
struct ADishonoredKActor_execTakeDamage_Native_Params
{
	int32_t                                            _Damage;                                          // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class AController*                                 _pInstigatedBy;                                   // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     _HitLocation;                                     // 0x0008 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     _Momentum;                                        // 0x0014 (0x000C) [0x0000000000000080] (CPF_Parm)    
	class UDamageType*                                 _pDamageType;                                     // 0x0020 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FTraceHitInfo                               _HitInfo;                                         // 0x0024 (0x001C) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	class AActor*                                      _pDamageCauser;                                   // 0x0040 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
};

// Function DishonoredGame.DishonoredKActor.TakeDamage
// [0x00024C00]  (iNative[13766])
struct ADishonoredKActor_eventTakeDamage_Params
{
	int32_t                                            Damage;                                           // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class AController*                                 InstigatedBy;                                     // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     HitLocation;                                      // 0x0008 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     Momentum;                                         // 0x0014 (0x000C) [0x0000000000000080] (CPF_Parm)    
	class UDamageType*                                 DamageType;                                       // 0x0020 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FTraceHitInfo                               HitInfo;                                          // 0x0024 (0x001C) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	class AActor*                                      DamageCauser;                                     // 0x0040 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
};

// Function DishonoredGame.DishonoredKActor.DestroyIfPlayerCantSeeMe
// [0x00020C00]  (iNative[13815])
struct ADishonoredKActor_eventDestroyIfPlayerCantSeeMe_Params
{
};

// Function DishonoredGame.DishonoredKAsset.TakeDamage_Native
// [0x00024400]  (iNative[45311])
struct ADishonoredKAsset_execTakeDamage_Native_Params
{
	int32_t                                            _Damage;                                          // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class AController*                                 _pInstigatedBy;                                   // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     _HitLocation;                                     // 0x0008 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     _Momentum;                                        // 0x0014 (0x000C) [0x0000000000000080] (CPF_Parm)    
	class UDamageType*                                 _pDamageType;                                     // 0x0020 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FTraceHitInfo                               _HitInfo;                                         // 0x0024 (0x001C) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	class AActor*                                      _pDamageCauser;                                   // 0x0040 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
};

// Function DishonoredGame.DishonoredKAsset.TakeDamage
// [0x00024D00]  (iNative[13766])
struct ADishonoredKAsset_eventTakeDamage_Params
{
	int32_t                                            Damage;                                           // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class AController*                                 InstigatedBy;                                     // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     HitLocation;                                      // 0x0008 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     Momentum;                                         // 0x0014 (0x000C) [0x0000000000000080] (CPF_Parm)    
	class UDamageType*                                 DamageType;                                       // 0x0020 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FTraceHitInfo                               HitInfo;                                          // 0x0024 (0x001C) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	class AActor*                                      DamageCauser;                                     // 0x0040 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
};

// Function DishonoredGame.DishonoredNote.PostRenderFor
// [0x00020902] 
struct ADishonoredNote_eventPostRenderFor_Params
{
	class APlayerController*                           PC;                                               // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class UCanvas*                                     Canvas;                                           // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     CameraPosition;                                   // 0x0008 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     CameraDir;                                        // 0x0014 (0x000C) [0x0000000000000080] (CPF_Parm)    
};

// Function DishonoredGame.DishonoredNote.NativeNotePostRender
// [0x00020500]  (iNative[43765])
struct ADishonoredNote_execNativeNotePostRender_Params
{
	class APlayerController*                           PC;                                               // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class UCanvas*                                     Canvas;                                           // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     CameraPosition;                                   // 0x0008 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     CameraDir;                                        // 0x0014 (0x000C) [0x0000000000000080] (CPF_Parm)    
};

// Function DishonoredGame.DishonoredPawn.OnDLC05SetStoryGroup
// [0x00020400]  (iNative[47581])
struct ADishonoredPawn_execOnDLC05SetStoryGroup_Params
{
	class USequenceAction*                             _pAction;                                         // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function DishonoredGame.DishonoredPawn.JumpOffPawn
// [0x00020400]  (iNative[21449])
struct ADishonoredPawn_execJumpOffPawn_Params
{
};

// Function DishonoredGame.DishonoredPawn.CrushedBy
// [0x00020002] 
struct ADishonoredPawn_execCrushedBy_Params
{
	class APawn*                                       OtherPawn;                                        // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function DishonoredGame.DishonoredPawn.CrushedBy_Native
// [0x00020400]  (iNative[30938])
struct ADishonoredPawn_execCrushedBy_Native_Params
{
	class APawn*                                       _pOtherPawn;                                      // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function DishonoredGame.DishonoredPawn.OnModifyElixirCount
// [0x00020400]  (iNative[43943])
struct ADishonoredPawn_execOnModifyElixirCount_Params
{
	class UDisSeqAct_ModifyElixirCount*                _pAction;                                         // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function DishonoredGame.DishonoredPawn.OnGetAbstractItemQuantity
// [0x00020400]  (iNative[43924])
struct ADishonoredPawn_execOnGetAbstractItemQuantity_Params
{
	class UDisSeqAct_GetAbstractItemQuantity*          _pAction;                                         // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function DishonoredGame.DishonoredPawn.OnRemoveAbstractItem
// [0x00020400]  (iNative[43959])
struct ADishonoredPawn_execOnRemoveAbstractItem_Params
{
	class UDisSeqAct_RemoveAbstractItem*               _pAction;                                         // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function DishonoredGame.DishonoredPawn.OnAddAbstractItem
// [0x00020400]  (iNative[43863])
struct ADishonoredPawn_execOnAddAbstractItem_Params
{
	class UDisSeqAct_AddAbstractItem*                  _pAction;                                         // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function DishonoredGame.DishonoredPawn.OnModifyAmmo
// [0x00020400]  (iNative[43942])
struct ADishonoredPawn_execOnModifyAmmo_Params
{
	class UDisSeqAct_ModifyAmmo*                       _pAction;                                         // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function DishonoredGame.DishonoredPawn.OnEquipItemType
// [0x00020400]  (iNative[43909])
struct ADishonoredPawn_execOnEquipItemType_Params
{
	class UDisSeqAct_EquipItemType*                    _pAction;                                         // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function DishonoredGame.DishonoredPawn.OnAddInventoryItem
// [0x00020400]  (iNative[43865])
struct ADishonoredPawn_execOnAddInventoryItem_Params
{
	class UDisSeqAct_AddInventoryItem*                 _pAction;                                         // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function DishonoredGame.DishonoredPawn.OnSetDisposition
// [0x00020400]  (iNative[43980])
struct ADishonoredPawn_execOnSetDisposition_Params
{
	class UDisSeqAct_SetDisposition*                   _pAction;                                         // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function DishonoredGame.DishonoredPawn.OnTeleport
// [0x00020102] 
struct ADishonoredPawn_execOnTeleport_Params
{
	class USeqAct_Teleport*                            _pAction;                                         // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function DishonoredGame.DishonoredPawn.OnTeleport_Native
// [0x00020400]  (iNative[43994])
struct ADishonoredPawn_execOnTeleport_Native_Params
{
	class USeqAct_Teleport*                            _pAction;                                         // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	bool                                               ReturnValue : 1;                                  // 0x0004 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function DishonoredGame.DishonoredPawn.Landed
// [0x00020802] 
struct ADishonoredPawn_eventLanded_Params
{
	struct FVector                                     HitNormal;                                        // 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	class AActor*                                      pFloorActor;                                      // 0x000C (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function DishonoredGame.DishonoredPawn.Landed_Native
// [0x00020400]  (iNative[35678])
struct ADishonoredPawn_execLanded_Native_Params
{
	struct FVector                                     HitNormal;                                        // 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	class AActor*                                      pFloorActor;                                      // 0x000C (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function DishonoredGame.DishonoredPawn.BreakConstraint
// [0x00020802] 
struct ADishonoredPawn_eventBreakConstraint_Params
{
	class FName                                        _JointName;                                       // 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function DishonoredGame.DishonoredPawn.ChooseAndTriggerDeathEvent
// [0x00020802] 
struct ADishonoredPawn_eventChooseAndTriggerDeathEvent_Params
{
	class UDamageType*                                 _pDamageType;                                     // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function DishonoredGame.DishonoredPawn.ChooseAndTriggerDeathEvent_Native
// [0x00020400]  (iNative[30864])
struct ADishonoredPawn_execChooseAndTriggerDeathEvent_Native_Params
{
	class UDamageType*                                 _pDamageType;                                     // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	bool                                               ReturnValue : 1;                                  // 0x0004 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function DishonoredGame.DishonoredPawn.PlayDying
// [0x00020102] 
struct ADishonoredPawn_execPlayDying_Params
{
	class AController*                                 Killer;                                           // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class UDamageType*                                 DamageType;                                       // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     HitLoc;                                           // 0x0008 (0x000C) [0x0000000000000080] (CPF_Parm)    
};

// Function DishonoredGame.DishonoredPawn.PlayDying_Native
// [0x00020500]  (iNative[44228])
struct ADishonoredPawn_execPlayDying_Native_Params
{
	class AController*                                 Killer;                                           // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class UDamageType*                                 DamageType;                                       // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     HitLoc;                                           // 0x0008 (0x000C) [0x0000000000000080] (CPF_Parm)    
};

// Function DishonoredGame.DishonoredPawn.TakeFallingDamage_Native
// [0x00020400]  (iNative[45312])
struct ADishonoredPawn_execTakeFallingDamage_Native_Params
{
	struct FVector                                     _HitNormal;                                       // 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	class AActor*                                      _pFloorActor;                                     // 0x000C (0x0004) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            ReturnValue;                                      // 0x0010 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function DishonoredGame.DishonoredPawn.TakeFallingDamage
// [0x00020002] 
struct ADishonoredPawn_execTakeFallingDamage_Params
{
	struct FVector                                     _HitNormal;                                       // 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	class AActor*                                      _pFloorActor;                                     // 0x000C (0x0004) [0x0000000000000080] (CPF_Parm)    
	// int32_t                                         DamageToTake;                                     // 0x0010 (0x0004) [0x0000000000000000]               
};

// Function DishonoredGame.DishonoredPawn.TakeDamage_Native
// [0x00424400]  (iNative[45311])
struct ADishonoredPawn_execTakeDamage_Native_Params
{
	int32_t                                            _rDamage;                                         // 0x0000 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	class AController*                                 _pInstigatedBy;                                   // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     _HitLocation;                                     // 0x0008 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     _rMomentum;                                       // 0x0014 (0x000C) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	class UDamageType*                                 _pDamageType;                                     // 0x0020 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FTraceHitInfo                               _HitInfo;                                         // 0x0024 (0x001C) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	class AActor*                                      _pDamageCauser;                                   // 0x0040 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
};

// Function DishonoredGame.DishonoredPawn.TakeDamage
// [0x00024C00]  (iNative[13766])
struct ADishonoredPawn_eventTakeDamage_Params
{
	int32_t                                            Damage;                                           // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class AController*                                 InstigatedBy;                                     // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     HitLocation;                                      // 0x0008 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     Momentum;                                         // 0x0014 (0x000C) [0x0000000000000080] (CPF_Parm)    
	class UDamageType*                                 DamageType;                                       // 0x0020 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FTraceHitInfo                               HitInfo;                                          // 0x0024 (0x001C) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	class AActor*                                      DamageCauser;                                     // 0x0040 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
};

// Function DishonoredGame.DishonoredPawn.FireTakeDamageKismetEvent
// [0x00020802] 
struct ADishonoredPawn_eventFireTakeDamageKismetEvent_Params
{
	class AActor*                                      _pInInstigator;                                   // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class UDamageType*                                 _pInDamageType;                                   // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            _inAmount;                                        // 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
	// int32_t                                         idx;                                              // 0x000C (0x0004) [0x0000000000000000]               
	// class USeqEvent_TakeDamage*                     dmgEvent;                                         // 0x0010 (0x0004) [0x0000000000000000]               
};

// Function DishonoredGame.DishonoredPawn.DisplayDebug
// [0x00420102] 
struct ADishonoredPawn_execDisplayDebug_Params
{
	class AHUD*                                        _HUD;                                             // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              _fOut_YL;                                         // 0x0004 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	float                                              _fOut_YPos;                                       // 0x0008 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
};

// Function DishonoredGame.DishonoredPawn.DisplayDebug_Native
// [0x00420400]  (iNative[32321])
struct ADishonoredPawn_execDisplayDebug_Native_Params
{
	class AHUD*                                        _pHUD;                                            // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              _rfOut_YL;                                        // 0x0004 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	float                                              _rfOut_YPos;                                      // 0x0008 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
};

// Function DishonoredGame.DishonoredRoute.ResolveRouteIndex
// [0x00420400]  (iNative[25166])
struct ADishonoredRoute_execResolveRouteIndex_Params
{
	int32_t                                            idx;                                              // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	uint8_t                                            RouteDirection;                                   // 0x0004 (0x0001) [0x0000000000000080] (CPF_Parm)    
	uint8_t                                            out_bComplete;                                    // 0x0005 (0x0001) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	uint8_t                                            out_bReverse;                                     // 0x0006 (0x0001) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	int32_t                                            ReturnValue;                                      // 0x0008 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function DishonoredGame.DishonoredRoute.OnToggle
// [0x00020400]  (iNative[23663])
struct ADishonoredRoute_execOnToggle_Params
{
	class USeqAct_Toggle*                              _pAction;                                         // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function DishonoredGame.DishonoredViewportClient.RemoveNPCView
// [0x00020002] 
struct UDishonoredViewportClient_execRemoveNPCView_Params
{
	class ADisDebugNPCController*                      _pPossessingController;                           // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	// int32_t                                         iOldIndex;                                        // 0x0004 (0x0004) [0x0000000000000000]               
	// class ULocalPlayer*                             pOldPlayer;                                       // 0x0008 (0x0004) [0x0000000000000000]               
};

// Function DishonoredGame.DishonoredViewportClient.AddNPCView
// [0x00020002] 
struct UDishonoredViewportClient_execAddNPCView_Params
{
	class ADisDebugNPCController*                      _pPossessingController;                           // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            iViewIndex;                                       // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function DishonoredGame.DishonoredViewportClient.DrawTransition
// [0x00020002] 
struct UDishonoredViewportClient_execDrawTransition_Params
{
	class UCanvas*                                     _pCanvas;                                         // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function DishonoredGame.DishonoredViewportClient.PostRender
// [0x00020802] 
struct UDishonoredViewportClient_eventPostRender_Params
{
	class UCanvas*                                     _pCanvas;                                         // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function DishonoredGame.DishonoredViewportClient.PostRender_Native
// [0x00020400]  (iNative[44363])
struct UDishonoredViewportClient_execPostRender_Native_Params
{
	class UCanvas*                                     _pCanvas;                                         // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function DishonoredGame.DisParticleSystemComponent.InitializeForPool
// [0x00020400]  (iNative[35594])
struct UDisParticleSystemComponent_execInitializeForPool_Params
{
};

// Function DishonoredGame.DisProtectionTuneSource.OnToggle
// [0x00020500]  (iNative[23663])
struct ADisProtectionTuneSource_execOnToggle_Params
{
	class USeqAct_Toggle*                              _pAction;                                         // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function DishonoredGame.DisSkeletalBreakable.TakeDamage
// [0x00024C00]  (iNative[13766])
struct ADisSkeletalBreakable_eventTakeDamage_Params
{
	int32_t                                            Damage;                                           // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class AController*                                 InstigatedBy;                                     // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     HitLocation;                                      // 0x0008 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     Momentum;                                         // 0x0014 (0x000C) [0x0000000000000080] (CPF_Parm)    
	class UDamageType*                                 DamageType;                                       // 0x0020 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FTraceHitInfo                               HitInfo;                                          // 0x0024 (0x001C) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	class AActor*                                      DamageCauser;                                     // 0x0040 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
};

// Function DishonoredGame.DisSkeletalBreakable.TakeDamage_Native
// [0x00024400]  (iNative[45311])
struct ADisSkeletalBreakable_execTakeDamage_Native_Params
{
	int32_t                                            _Damage;                                          // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class AController*                                 _pInstigatedBy;                                   // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     _HitLocation;                                     // 0x0008 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     _Momentum;                                        // 0x0014 (0x000C) [0x0000000000000080] (CPF_Parm)    
	class UDamageType*                                 _pDamageType;                                     // 0x0020 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FTraceHitInfo                               _HitInfo;                                         // 0x0024 (0x001C) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	class AActor*                                      _pDamageCauser;                                   // 0x0040 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
};

// Function DishonoredGame.DisSkeletalBreakable.BreakConstraint
// [0x00020802] 
struct ADisSkeletalBreakable_eventBreakConstraint_Params
{
	struct FVector                                     _Impulse;                                         // 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     _HitLocation;                                     // 0x000C (0x000C) [0x0000000000000080] (CPF_Parm)    
	class FName                                        _JointName;                                       // 0x0018 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function DishonoredGame.DishonoredUsableObject.OnToggleHidden
// [0x00020102] 
struct ADishonoredUsableObject_execOnToggleHidden_Params
{
	class USeqAct_ToggleHidden*                        Action;                                           // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function DishonoredGame.DishonoredUsableObject.OnToggle
// [0x00020102] 
struct ADishonoredUsableObject_execOnToggle_Params
{
	class USeqAct_Toggle*                              _pAction;                                         // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function DishonoredGame.DishonoredUsableObject.OnToggle_Native
// [0x00020400]  (iNative[23664])
struct ADishonoredUsableObject_execOnToggle_Native_Params
{
	class USeqAct_Toggle*                              _pAction;                                         // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function DishonoredGame.DisProjectileLauncher.OnToggle
// [0x00020102] 
struct ADisProjectileLauncher_execOnToggle_Params
{
	class USeqAct_Toggle*                              _pAction;                                         // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function DishonoredGame.DisProjectileLauncher.OnToggle_Native
// [0x00020400]  (iNative[23664])
struct ADisProjectileLauncher_execOnToggle_Native_Params
{
	class USeqAct_Toggle*                              _pAction;                                         // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function DishonoredGame.DisProjectileLauncher.BaseChange
// [0x00020C00]  (iNative[311])
struct ADisProjectileLauncher_eventBaseChange_Params
{
};

// Function DishonoredGame.DisTrigger.CallUsedBy
// [0x00020802] 
struct ADisTrigger_eventCallUsedBy_Params
{
	class APawn*                                       User;                                             // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	bool                                               ReturnValue : 1;                                  // 0x0004 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function DishonoredGame.DisTriggerAbstractItem.OnToggle
// [0x00020102] 
struct ADisTriggerAbstractItem_execOnToggle_Params
{
	class USeqAct_Toggle*                              _pAction;                                         // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function DishonoredGame.DisTriggerAbstractItem.OnToggle_Native
// [0x00020400]  (iNative[23664])
struct ADisTriggerAbstractItem_execOnToggle_Native_Params
{
	class USeqAct_Toggle*                              _pAction;                                         // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function DishonoredGame.DisTriggerAbstractItem.CallUsedBy
// [0x00020802] 
struct ADisTriggerAbstractItem_eventCallUsedBy_Params
{
	class APawn*                                       User;                                             // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	bool                                               ReturnValue : 1;                                  // 0x0004 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function DishonoredGame.DisTripwire.TakeDamage
// [0x00024C00]  (iNative[13766])
struct ADisTripwire_eventTakeDamage_Params
{
	int32_t                                            Damage;                                           // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class AController*                                 InstigatedBy;                                     // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     HitLocation;                                      // 0x0008 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     Momentum;                                         // 0x0014 (0x000C) [0x0000000000000080] (CPF_Parm)    
	class UDamageType*                                 DamageType;                                       // 0x0020 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FTraceHitInfo                               HitInfo;                                          // 0x0024 (0x001C) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	class AActor*                                      DamageCauser;                                     // 0x0040 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
};

// Function DishonoredGame.DisTripwire.TakeDamage_Native
// [0x00024400]  (iNative[45311])
struct ADisTripwire_execTakeDamage_Native_Params
{
	int32_t                                            _Damage;                                          // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class AController*                                 _pInstigatedBy;                                   // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     _HitLocation;                                     // 0x0008 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     _Momentum;                                        // 0x0014 (0x000C) [0x0000000000000080] (CPF_Parm)    
	class UDamageType*                                 _pDamageType;                                     // 0x0020 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FTraceHitInfo                               _HitInfo;                                         // 0x0024 (0x001C) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	class AActor*                                      _pDamageCauser;                                   // 0x0040 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
};

// Function DishonoredGame.DisWatchTower.TakeDamage
// [0x00024C00]  (iNative[13766])
struct ADisWatchTower_eventTakeDamage_Params
{
	int32_t                                            Damage;                                           // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class AController*                                 InstigatedBy;                                     // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     HitLocation;                                      // 0x0008 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     Momentum;                                         // 0x0014 (0x000C) [0x0000000000000080] (CPF_Parm)    
	class UDamageType*                                 DamageType;                                       // 0x0020 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FTraceHitInfo                               HitInfo;                                          // 0x0024 (0x001C) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	class AActor*                                      DamageCauser;                                     // 0x0040 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
};

// Function DishonoredGame.DisWatchTower.TakeDamage_Native
// [0x00424400]  (iNative[45311])
struct ADisWatchTower_execTakeDamage_Native_Params
{
	int32_t                                            _rDamage;                                         // 0x0000 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	class AController*                                 _pInstigatedBy;                                   // 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     _HitLocation;                                     // 0x0008 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     _rMomentum;                                       // 0x0014 (0x000C) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	class UDamageType*                                 _pDamageType;                                     // 0x0020 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FTraceHitInfo                               _HitInfo;                                         // 0x0024 (0x001C) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	class AActor*                                      _pDamageCauser;                                   // 0x0040 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
};

// Function DishonoredGame.DisWatchTower.OnWatchTowerShootAtTarget
// [0x00020400]  (iNative[44005])
struct ADisWatchTower_execOnWatchTowerShootAtTarget_Params
{
	class UDisSeqAct_WatchTowerShootAtTarget*          _pAction;                                         // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function DishonoredGame.DisWatchTower.OnSetDisposition
// [0x00020400]  (iNative[43980])
struct ADisWatchTower_execOnSetDisposition_Params
{
	class UDisSeqAct_SetDisposition*                   _pAction;                                         // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function DishonoredGame.DisTweaks_Faction.OnSetDisposition
// [0x00020400]  (iNative[43980])
struct UDisTweaks_Faction_execOnSetDisposition_Params
{
	class UDisSeqAct_SetDisposition*                   _pAction;                                         // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function DishonoredGame.DisGFxMoviePlayerBase.Req_EquipmentIconImage
// [0x00020401]  (iNative[44708])
struct UDisGFxMoviePlayerBase_execReq_EquipmentIconImage_Params
{
	int32_t                                            _ItemIdx;                                         // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class FString                                      ReturnValue;                                      // 0x0004 (0x000C) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function DishonoredGame.DisGFxMoviePlayerBase.HideMessageBox
// [0x00020401]  (iNative[35464])
struct UDisGFxMoviePlayerBase_execHideMessageBox_Params
{
};

// Function DishonoredGame.DisGFxMoviePlayerBase.AddMessageBoxTimer
// [0x00020401]  (iNative[30028])
struct UDisGFxMoviePlayerBase_execAddMessageBoxTimer_Params
{
	float                                              _fDuration;                                       // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function DishonoredGame.DisGFxMoviePlayerBase.ShowMessageBox
// [0x00020401]  (iNative[44892])
struct UDisGFxMoviePlayerBase_execShowMessageBox_Params
{
	class FString                                      _rMessage;                                        // 0x0000 (0x000C) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      _rButton0;                                        // 0x000C (0x000C) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      _rButton1;                                        // 0x0018 (0x000C) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      _rButton2;                                        // 0x0024 (0x000C) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
};

// Function DishonoredGame.DisGFxMoviePlayerBase.FormatText
// [0x00020401]  (iNative[35122])
struct UDisGFxMoviePlayerBase_execFormatText_Params
{
	class FString                                      _rTextVarPath;                                    // 0x0000 (0x000C) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
};

// Function DishonoredGame.DisGFxMoviePlayerBase.OnFocusLost
// [0x00020C00]  (iNative[13801])
struct UDisGFxMoviePlayerBase_eventOnFocusLost_Params
{
	int32_t                                            _LocalPlayerIndex;                                // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function DishonoredGame.DisGFxMoviePlayerBase.OnFocusGained
// [0x00020C00]  (iNative[13800])
struct UDisGFxMoviePlayerBase_eventOnFocusGained_Params
{
	int32_t                                            _LocalPlayerIndex;                                // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function DishonoredGame.DisGFxMoviePlayerBase.WidgetInitialized_Native
// [0x00020400]  (iNative[45814])
struct UDisGFxMoviePlayerBase_execWidgetInitialized_Native_Params
{
	class FName                                        _WidgetName;                                      // 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class FName                                        _WidgetPath;                                      // 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UGFxObject*                                  _pWidget;                                         // 0x0010 (0x0004) [0x0000000000000080] (CPF_Parm)    
	bool                                               ReturnValue : 1;                                  // 0x0014 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function DishonoredGame.DisGFxMoviePlayerBase.WidgetInitialized
// [0x00020802] 
struct UDisGFxMoviePlayerBase_eventWidgetInitialized_Params
{
	class FName                                        _WidgetName;                                      // 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class FName                                        _WidgetPath;                                      // 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UGFxObject*                                  _pWidget;                                         // 0x0010 (0x0004) [0x0000000000000080] (CPF_Parm)    
	bool                                               ReturnValue : 1;                                  // 0x0014 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function DishonoredGame.DisGFxMoviePlayerBase.HasFinishedAsyncLoading
// [0x00020400]  (iNative[35452])
struct UDisGFxMoviePlayerBase_execHasFinishedAsyncLoading_Params
{
	bool                                               ReturnValue : 1;                                  // 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function DishonoredGame.DisGFxMoviePlayerBase.SetPauseDuringAsyncLoading
// [0x00020802] 
struct UDisGFxMoviePlayerBase_eventSetPauseDuringAsyncLoading_Params
{
	uint32_t                                           _bDesiredPauseState : 1;                          // 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	// class UEngine*                                  Eng;                                              // 0x0004 (0x0004) [0x0000000000000000]               
	// class APlayerController*                        PC;                                               // 0x0008 (0x0004) [0x0000000000000000]               
};

// Function DishonoredGame.DisGFxMoviePlayerBase.CaptureAnalogInput
// [0x00020400]  (iNative[30807])
struct UDisGFxMoviePlayerBase_execCaptureAnalogInput_Params
{
	uint32_t                                           _bCapture : 1;                                    // 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function DishonoredGame.DisGFxMoviePlayerBase.Advance
// [0x00020400]  (iNative[28826])
struct UDisGFxMoviePlayerBase_execAdvance_Params
{
	float                                              _fDeltaTime;                                      // 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

