/*
#############################################################################################
# Dishonered (DSDK) SDK 1.0.0.0
# Generated with the CodeRedGenerator v1.1.3
# ========================================================================================= #
# File: DishonoredGame_structs.hpp
# ========================================================================================= #
# Credits: ItsBranK, TheFeckless
# Links: www.github.com/CodeRedModding/CodeRed-Generator
#############################################################################################
*/
#pragma once
/*
# ========================================================================================= #
# Structs
# ========================================================================================= #
*/

// ScriptStruct DishonoredGame.DisGlobalEnums.DisVectorSpring
// 0x0034
struct FDisVectorSpring
{
	struct FVector                                     m_Value;                                       // 0x0000 (0x000C) [0x0000000000000000]               
	struct FVector                                     m_Target;                                      // 0x000C (0x000C) [0x0000000000000000]               
	struct FVector                                     m_Velocity;                                    // 0x0018 (0x000C) [0x0000000000000000]               
	float                                              m_fTimeRemainder;                              // 0x0024 (0x0004) [0x0000000000000000]               
	float                                              m_fSpringConstant;                             // 0x0028 (0x0004) [0x0000000000004000] (CPF_Config)  
	float                                              m_fUpdateFrequency;                            // 0x002C (0x0004) [0x0000000000000000]               
	float                                              m_fMass;                                       // 0x0030 (0x0004) [0x0000000000000000]               
};

// ScriptStruct DishonoredGame.DisGlobalEnums.DisRollingAverage
// 0x0030
struct FDisRollingAverage
{
	float                                              m_History[10];                                 // 0x0000 (0x0028) [0x0000000000000000]               
	int32_t                                            m_HistoryCount;                                // 0x0028 (0x0004) [0x0000000000000000]               
	float                                              m_fCurrentTotal;                               // 0x002C (0x0004) [0x0000000000000000]               
};

// ScriptStruct DishonoredGame.DisGlobalEnums.DisNonRepeatINTRandomHelper
// 0x0004
struct FDisNonRepeatINTRandomHelper
{
	int32_t                                            m_iLastReturnedValue;                          // 0x0000 (0x0004) [0x0000000000000000]               
};

// ScriptStruct DishonoredGame.DisGlobalEnums.DisRelationshipOverrideInfo
// 0x0078
struct FDisRelationshipOverrideInfo
{
	uint8_t                                            UnknownData00[0x78];                          // 0x0000 (0x0078) MISSED OFFSET
};

// ScriptStruct DishonoredGame.DisGlobalEnums.DisMantleFinderOwnerInfo
// 0x0040
struct FDisMantleFinderOwnerInfo
{
	struct FVector                                     m_FootPos;                                     // 0x0000 (0x000C) [0x0000000000000000]               
	struct FVector                                     m_CrouchExtent;                                // 0x000C (0x000C) [0x0000000000000000]               
	struct FVector                                     m_StandExtent;                                 // 0x0018 (0x000C) [0x0000000000000000]               
	struct FVector                                     m_Velocity;                                    // 0x0024 (0x000C) [0x0000000000000000]               
	struct FVector                                     m_Facing;                                      // 0x0030 (0x000C) [0x0000000000000000]               
	float                                              m_fClearDistanceAboveOwner;                    // 0x003C (0x0004) [0x0000000000000000]               
};

// ScriptStruct DishonoredGame.DisGlobalEnums.DisInventoryAmmoEntry
// 0x0008
struct FDisInventoryAmmoEntry
{
	uint8_t                                            m_AmmoType;                                    // 0x0000 (0x0001) [0x0000000000000001] (CPF_Edit)    
	int32_t                                            m_AmmoAmount;                                  // 0x0004 (0x0004) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct DishonoredGame.DisGlobalEnums.DisAbstractItemInfo
// 0x000C
struct FDisAbstractItemInfo
{
	class UDisAbstractItem*                            m_pItem;                                       // 0x0000 (0x0004) [0x0000000000000001] (CPF_Edit)    
	int32_t                                            m_Quantity;                                    // 0x0004 (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           m_bHidden : 1;                                 // 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct DishonoredGame.DisGlobalEnums.DisInventoryLoadout
// 0x0034
struct FDisInventoryLoadout
{
	class TArray<class UDisTweaks_InventoryItem*>      m_Items;                                       // 0x0000 (0x000C) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	class TArray<struct FDisInventoryAmmoEntry>        m_Ammo;                                        // 0x000C (0x000C) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	int32_t                                            m_ElixirCounts[2];                             // 0x0018 (0x0008) [0x0000000000000001] (CPF_Edit)    
	class TArray<struct FDisAbstractItemInfo>          m_AbstractItems;                               // 0x0020 (0x000C) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	class UDishonoredInventoryItem*                    m_pDefaultEquipType_Primary;                   // 0x002C (0x0004) [0x0000000000000001] (CPF_Edit)    
	class UDishonoredInventoryItem*                    m_pDefaultEquipType_Secondary;                 // 0x0030 (0x0004) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct DishonoredGame.DisGlobalEnums.DisZoneTracker
// 0x000C
struct FDisZoneTracker
{
	int32_t                                            m_ZoneRefCount;                                // 0x0000 (0x0004) [0x0000000000000000]               
	int32_t                                            m_ZoneTickTag_Enter;                           // 0x0004 (0x0004) [0x0000000000000000]               
	int32_t                                            m_ZoneTickTag_Exit;                            // 0x0008 (0x0004) [0x0000000000000000]               
};

// ScriptStruct DishonoredGame.DisGlobalEnums.DisBoneAtomsFilter
// 0x0034
struct FDisBoneAtomsFilter
{
	class TArray<uint8_t>                              m_RelevantBones;                               // 0x0000 (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
	class TArray<uint8_t>                              m_DiscardedBones;                              // 0x000C (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
	class TArray<uint8_t>                              m_ExclusionStarts;                             // 0x0018 (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
	class TArray<uint8_t>                              m_ExclusionEnds;                               // 0x0024 (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
	int32_t                                            m_iNumIncomingBones;                           // 0x0030 (0x0004) [0x0000000000000000]               
};

// ScriptStruct DishonoredGame.DisGlobalEnums.DisConvSaveData_Label
// 0x000C
struct FDisConvSaveData_Label
{
	class FName                                        m_Label;                                       // 0x0000 (0x0008) [0x0000000000000000]               
	int32_t                                            m_NumTimesFired;                               // 0x0008 (0x0004) [0x0000000000000000]               
};

// ScriptStruct DishonoredGame.DisGlobalEnums.DisConvSaveData_Conversation
// 0x001C
struct FDisConvSaveData_Conversation
{
	class FString                                      m_Conversation;                                // 0x0000 (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
	int32_t                                            m_NumTimesFired;                               // 0x000C (0x0004) [0x0000000000000000]               
	class TArray<struct FDisConvSaveData_Label>        m_LabelData;                                   // 0x0010 (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct DishonoredGame.DisGlobalEnums.DisConvSaveData_DialogTree
// 0x001C
struct FDisConvSaveData_DialogTree
{
	class FString                                      m_DialogTree;                                  // 0x0000 (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
	int32_t                                            m_NumTimesFired;                               // 0x000C (0x0004) [0x0000000000000000]               
	class TArray<struct FDisConvSaveData_Conversation> m_ConvData;                                    // 0x0010 (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct DishonoredGame.DisGlobalEnums.DisConvSaveData
// 0x000C
struct FDisConvSaveData
{
	class TArray<struct FDisConvSaveData_DialogTree>   m_DialogData;                                  // 0x0000 (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct DishonoredGame.DisGlobalEnums.DisHookParameters
// 0x002C
struct FDisHookParameters
{
	class FName                                        m_KismetDialogHook;                            // 0x0000 (0x0008) [0x0000000000002000] (CPF_Transient)
	class FName                                        m_AudioLogDialogHook;                          // 0x0008 (0x0008) [0x0000000000002000] (CPF_Transient)
	class UDisNPCDistractionComponent*                 m_pDistraction;                                // 0x0010 (0x0004) [0x0000000004082008] (CPF_ExportObject | CPF_Transient | CPF_Component | CPF_EditInline)
	class AActor*                                      m_pLastWitnessedInteractable;                  // 0x0014 (0x0004) [0x0000000000002000] (CPF_Transient)
	class UDishonoredActivePowerComponent*             m_pLastWitnessedMagic;                         // 0x0018 (0x0004) [0x0000000000002000] (CPF_Transient)
	uint8_t                                            m_InvestigateHookSource;                       // 0x001C (0x0001) [0x0000000000002000] (CPF_Transient)
	class AActor*                                      m_pHeartTargetedActor;                         // 0x0020 (0x0004) [0x0000000000002000] (CPF_Transient)
	class UDisCorpseInterface*                         m_pCorpse_Object;                              // 0x0024 (0x0008) [0x0000000000002000] (CPF_Transient)
	class UDisCorpseInterface*                         m_pCorpse_Interface;                           // 0x0024 (0x0008) [0x0000000000002000] (CPF_Transient)
};

// ScriptStruct DishonoredGame.DisNoiseMakerInterface.DisAudioCellCache
// 0x0014
struct FDisAudioCellCache
{
	struct FVector                                     m_CachedPosition;                              // 0x0000 (0x000C) [0x0000000000002000] (CPF_Transient)
	class ADishonoredAudioVolume*                      m_pCachedCell;                                 // 0x000C (0x0004) [0x0000000000002000] (CPF_Transient)
	float                                              m_fCacheTolerance;                             // 0x0010 (0x0004) [0x0000000000002000] (CPF_Transient)
};

// ScriptStruct DishonoredGame.DishonoredKActor.DisPhysicsContactInfo
// 0x001C
struct FDisPhysicsContactInfo
{
	float                                              m_fLastImpactTime;                             // 0x0000 (0x0004) [0x0000000000000000]               
	float                                              m_fRefireDelay;                                // 0x0004 (0x0004) [0x0000000000000000]               
	float                                              m_fMinImpactSpeed;                             // 0x0008 (0x0004) [0x0000000000000000]               
	float                                              m_fLastSlideTime;                              // 0x000C (0x0004) [0x0000000000000000]               
	float                                              m_fRefireDelay_Slide;                          // 0x0010 (0x0004) [0x0000000000000000]               
	float                                              m_fMinSlideSpeed;                              // 0x0014 (0x0004) [0x0000000000000000]               
	uint32_t                                           m_bSlideActive : 1;                            // 0x0018 (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           m_bSlideActive_Cur : 1;                        // 0x0018 (0x0004) [0x0000000000000000] [0x00000002] 
};

// ScriptStruct DishonoredGame.DisGFxMoviePlayerBase.DisMovieSpaceInfo
// 0x0024
struct FDisMovieSpaceInfo
{
	struct FVector2D                                   m_ScreenSize;                                  // 0x0000 (0x0008) [0x0000000000000000]               
	struct FVector2D                                   m_MovieSize;                                   // 0x0008 (0x0008) [0x0000000000000000]               
	float                                              m_fScreenToMovieScaling;                       // 0x0010 (0x0004) [0x0000000000000000]               
	struct FVector2D                                   m_MovieSpaceSize;                              // 0x0014 (0x0008) [0x0000000000000000]               
	struct FVector2D                                   m_EmptySpace;                                  // 0x001C (0x0008) [0x0000000000000000]               
};

// ScriptStruct DishonoredGame.DisGFxMoviePlayerHUD.DisTutorialInfo
// 0x003D
struct FDisTutorialInfo
{
	int32_t                                            m_ID;                                          // 0x0000 (0x0004) [0x0000000000000000]               
	uint8_t                                            m_Type;                                        // 0x0004 (0x0001) [0x0000000000000000]               
	float                                              m_fTimeLeft;                                   // 0x0008 (0x0004) [0x0000000000000000]               
	uint32_t                                           m_bShowInWindow : 1;                           // 0x000C (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           m_bShowOnce : 1;                               // 0x000C (0x0004) [0x0000000000000000] [0x00000002] 
	uint32_t                                           m_bForceDisplay : 1;                           // 0x000C (0x0004) [0x0000000000000000] [0x00000004] 
	uint32_t                                           m_bGamepad : 1;                                // 0x000C (0x0004) [0x0000000000000000] [0x00000008] 
	class FString                                      m_MessageLocFile;                              // 0x0010 (0x000C) [0x0000000000500000] (CPF_NeedCtorLink)
	class FString                                      m_MessageLocSection;                           // 0x001C (0x000C) [0x0000000000500000] (CPF_NeedCtorLink)
	class FString                                      m_MessageLocKey;                               // 0x0028 (0x000C) [0x0000000000500000] (CPF_NeedCtorLink)
	uint8_t                                            m_NoteType;                                    // 0x0034 (0x0001) [0x0000000000000000]               
	struct FPointer                                    m_pNoteParams;                                 // 0x0038 (0x0004) [0x0000000000001000] (CPF_Native)  
	uint8_t                                            m_JournalTab;                                  // 0x003C (0x0001) [0x0000000000000000]               
	uint8_t                                            MinStructAlignment[0x3];                       // 0x003D (0x0003) ADDED PADDING
};

// ScriptStruct DishonoredGame.DisTweaksBase.DisTweakVersionBaseClass
// 0x0010
struct FDisTweakVersionBaseClass
{
	class FString                                      m_BaseClassName;                               // 0x0000 (0x000C) [0x0000000000420001] (CPF_Edit | CPF_EditConst | CPF_NeedCtorLink)
	int32_t                                            m_VersionNum;                                  // 0x000C (0x0004) [0x0000000000020001] (CPF_Edit | CPF_EditConst)
};

// ScriptStruct DishonoredGame.DisTweaksBase.DisTweakFallbackInfo
// 0x0010
struct FDisTweakFallbackInfo
{
	class FString                                      m_PropertyPathName;                            // 0x0000 (0x000C) [0x0000000000400000] (CPF_NeedCtorLink)
	uint32_t                                           m_bProcessed : 1;                              // 0x000C (0x0004) [0x0000000000002000] [0x00000001] (CPF_Transient)
};

// ScriptStruct DishonoredGame.DisTweaksBase.DisTweakCookedFallback
// 0x0008
struct FDisTweakCookedFallback
{
	class FName                                        m_FallbackName;                                // 0x0000 (0x0008) [0x0000000000000000]               
};

// ScriptStruct DishonoredGame.DisTweaksBase.DisTweakChildInfo_ChildName
// 0x000C
struct FDisTweakChildInfo_ChildName
{
	class FName                                        m_ChildTweakName;                              // 0x0000 (0x0008) [0x0000000000000000]               
	int32_t                                            m_iAdditionalIndex;                            // 0x0008 (0x0004) [0x0000000000000000]               
};

// ScriptStruct DishonoredGame.DisTweaksBase.DisTweakChildInfo
// 0x001C
struct FDisTweakChildInfo
{
	struct FDisTweakChildInfo_ChildName                m_ChildTweakName;                              // 0x0000 (0x000C) [0x0000000000000000]               
	class UDisTweaksBase*                              m_pChildTweak;                                 // 0x000C (0x0004) [0x0000000000000000]               
	int32_t                                            m_ChildTweakFlags;                             // 0x0010 (0x0004) [0x0000000000000000]               
	class FName                                        m_GroupName;                                   // 0x0014 (0x0008) [0x0000000800000000] (CPF_EditorOnly)
};

// ScriptStruct DishonoredGame.DisTweaksBase.DisTweakError
// 0x001C
struct FDisTweakError
{
	class FName                                        m_ErrorID;                                     // 0x0000 (0x0008) [0x0000000000000000]               
	class FName                                        m_ExtraInfo;                                   // 0x0008 (0x0008) [0x0000000000000000]               
	class FName                                        m_ExtraInfo2;                                  // 0x0010 (0x0008) [0x0000000000000000]               
	class UDisTweaksBase*                              m_pOwner;                                      // 0x0018 (0x0004) [0x0000000000000000]               
};

// ScriptStruct DishonoredGame.DisTweaksBase.DisTweaksGenericThumbnailItem
// 0x0028
struct FDisTweaksGenericThumbnailItem
{
	class FName                                        m_ItemName;                                    // 0x0000 (0x0008) [0x0000000000002000] (CPF_Transient)
	class FName                                        m_AttachToItem;                                // 0x0008 (0x0008) [0x0000000000002000] (CPF_Transient)
	class FName                                        m_AttachToSocket;                              // 0x0010 (0x0008) [0x0000000000002000] (CPF_Transient)
	int32_t                                            m_Flags;                                       // 0x0018 (0x0004) [0x0000000000002000] (CPF_Transient)
	class USkeletalMesh*                               m_pSkeletalMesh;                               // 0x001C (0x0004) [0x0000000000002000] (CPF_Transient)
	class UStaticMesh*                                 m_pStaticMesh;                                 // 0x0020 (0x0004) [0x0000000000002000] (CPF_Transient)
	class UPrimitiveComponent*                         m_pCachedComponent;                            // 0x0024 (0x0004) [0x0000000004082008] (CPF_ExportObject | CPF_Transient | CPF_Component | CPF_EditInline)
};

// ScriptStruct DishonoredGame.DisTweaks_GFxMoviePlayerBase.DisSoundThemeBinding
// 0x0010
struct FDisSoundThemeBinding
{
	class FName                                        ThemeName;                                     // 0x0000 (0x0008) [0x0000000000000001] (CPF_Edit)    
	class UDisUISoundTheme*                            Theme;                                         // 0x0008 (0x0004) [0x0000000004400009] (CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline)
	class UDisUISoundTheme*                            ExternalTheme;                                 // 0x000C (0x0004) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct DishonoredGame.DisAttentionDefs.DisLeakyAccumulator
// 0x0010
struct FDisLeakyAccumulator
{
	float                                              m_fCurrentValue;                               // 0x0000 (0x0004) [0x0000000000000000]               
	float                                              m_fLeakRate;                                   // 0x0004 (0x0004) [0x0000000000000000]               
	float                                              m_fMinValue;                                   // 0x0008 (0x0004) [0x0000000000000000]               
	float                                              m_fMaxValue;                                   // 0x000C (0x0004) [0x0000000000000000]               
};

// ScriptStruct DishonoredGame.DisAttentionDefs.DisVisCalcTuningParamsCurvePoint
// 0x0008
struct FDisVisCalcTuningParamsCurvePoint
{
	float                                              m_fInputValue;                                 // 0x0000 (0x0004) [0x0000400000000001] (CPF_Edit)    
	float                                              m_fOutputValue;                                // 0x0004 (0x0004) [0x0000400000000001] (CPF_Edit)    
};

// ScriptStruct DishonoredGame.DisAttentionDefs.DisVisCalcTuningParams
// 0x0020
struct FDisVisCalcTuningParams
{
	uint8_t                                            m_ApplyOp;                                     // 0x0000 (0x0001) [0x0000400000000001] (CPF_Edit)    
	float                                              m_fScalar;                                     // 0x0004 (0x0004) [0x0000400000000001] (CPF_Edit)    
	float                                              m_fBias;                                       // 0x0008 (0x0004) [0x0000400000000001] (CPF_Edit)    
	float                                              m_fExponent;                                   // 0x000C (0x0004) [0x0000400000000001] (CPF_Edit)    
	uint32_t                                           m_bUsePointsInsteadOfFormula : 1;              // 0x0010 (0x0004) [0x0000400000000001] [0x00000001] (CPF_Edit)
	class TArray<struct FDisVisCalcTuningParamsCurvePoint> m_Points;                                      // 0x0014 (0x000C) [0x0000400000400001] (CPF_Edit | CPF_NeedCtorLink)
};

// ScriptStruct DishonoredGame.DisAttentionDefs.DisAttentionLevelThreshold
// 0x000C
struct FDisAttentionLevelThreshold
{
	float                                              m_fAttentionLevelToStart;                      // 0x0000 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              m_fAttentionLevelToStop;                       // 0x0004 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              m_fStoppingVariance;                           // 0x0008 (0x0004) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct DishonoredGame.DisAttentionDefs.DisAttentionChangeReasonSettings
// 0x0004
struct FDisAttentionChangeReasonSettings
{
	uint32_t                                           m_bCanIncreaseToBusted : 1;                    // 0x0000 (0x0004) [0x0000000000000001] [0x00000001] (CPF_Edit)
};

// ScriptStruct DishonoredGame.DisAttentionDefs.DisAttnTargetParams
// 0x0040
struct FDisAttnTargetParams
{
	struct FPointer                                    m_pTargetTweaks;                               // 0x0000 (0x0004) [0x0000000000001000] (CPF_Native)  
	struct FPointer                                    m_pObservableComponent;                        // 0x0004 (0x0004) [0x0000000000001000] (CPF_Native)  
	struct FVector                                     m_Location;                                    // 0x0008 (0x000C) [0x0000000000000000]               
	struct FVector                                     m_Velocity;                                    // 0x0014 (0x000C) [0x0000000000000000]               
	struct FVector                                     m_Extent;                                      // 0x0020 (0x000C) [0x0000000000000000]               
	struct FVector                                     m_FocalPoint;                                  // 0x002C (0x000C) [0x0000000000000000]               
	uint32_t                                           m_bIsPlayer : 1;                               // 0x0038 (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           m_bIsDead : 1;                                 // 0x0038 (0x0004) [0x0000000000000000] [0x00000002] 
	uint32_t                                           m_bIsCombatable : 1;                           // 0x0038 (0x0004) [0x0000000000000000] [0x00000004] 
	class AActor*                                      m_pActor;                                      // 0x003C (0x0004) [0x0000000000000000]               
};

// ScriptStruct DishonoredGame.DisAttentionDefs.DisAttentionProxy
// 0x0010
struct FDisAttentionProxy
{
	class UDishonoredAIBrain*                          m_pBrain;                                      // 0x0000 (0x0004) [0x0000000000000000]               
	class UDisAttentionTargetInterface*                m_pTarget_Object;                              // 0x0004 (0x0008) [0x0000000000000000] 
	class UDisAttentionTargetInterface*                m_pTarget_Interface;                           // 0x0004 (0x0008) [0x0000000000000000]               
	class AActor*                                      m_pCachedTargetActor;                          // 0x000C (0x0004) [0x0002000000000000]               
};

// ScriptStruct DishonoredGame.DisAttentionDefs.DisAttentionChangeReasonInfo
// 0x000C
struct FDisAttentionChangeReasonInfo
{
	class AActor*                                      m_pActor;                                      // 0x0000 (0x0004) [0x0000000000000000]               
	int32_t                                            m_iParam1;                                     // 0x0004 (0x0004) [0x0000000000000000]               
	int32_t                                            m_iParam2;                                     // 0x0008 (0x0004) [0x0000000000000000]               
};

// ScriptStruct DishonoredGame.DisAttentionDefs.DisAttentionChangeReason
// 0x0010
struct FDisAttentionChangeReason
{
	uint8_t                                            m_ReasonType;                                  // 0x0000 (0x0001) [0x0000000000000000]               
	struct FDisAttentionChangeReasonInfo               m_ReasonInfo;                                  // 0x0004 (0x000C) [0x0000000000000000]               
};

// ScriptStruct DishonoredGame.DisAttentionDefs.DisAttentionProxyInfo
// 0x0040
struct FDisAttentionProxyInfo
{
	struct FVector                                     m_Loc;                                         // 0x0000 (0x000C) [0x0000000000000000]               
	struct FVector                                     m_Vel;                                         // 0x000C (0x000C) [0x0000000000000000]               
	float                                              m_fHeight;                                     // 0x0018 (0x0004) [0x0000000000000000]               
	struct FDisAttentionChangeReason                   m_ProxyUpdateReason;                           // 0x001C (0x0010) [0x0000000000000000]               
	int32_t                                            m_AttentionTag;                                // 0x002C (0x0004) [0x0000000000000000]               
	uint8_t                                            m_Status;                                      // 0x0030 (0x0001) [0x0000000000000000]               
	struct FVector                                     m_MostRecentVerifiedLoc;                       // 0x0034 (0x000C) [0x0000000000000000]               
};

// ScriptStruct DishonoredGame.DisAttentionDefs.DisAppliedAttentionChangeInfo
// 0x0048
struct FDisAppliedAttentionChangeInfo
{
	float                                              m_fChangeAmount;                               // 0x0000 (0x0004) [0x0000000000000000]               
	float                                              m_fChangeAmount_Unclamped;                     // 0x0004 (0x0004) [0x0000000000000000]               
	struct FDisAttentionProxyInfo                      m_ProxyInfoFromChange;                         // 0x0008 (0x0040) [0x0000000000000000]               
};

// ScriptStruct DishonoredGame.DisNativeStateTransitionLogic.StateTransitionLogic
// 0x0009
struct FStateTransitionLogic
{
	class UDishonoredNativeState*                      m_pFromClass;                                  // 0x0000 (0x0004) [0x0000000000000001] (CPF_Edit)    
	class UDishonoredNativeState*                      m_pToClass;                                    // 0x0004 (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint8_t                                            m_Result;                                      // 0x0008 (0x0001) [0x0000000000000001] (CPF_Edit)    
	uint8_t                                            MinStructAlignment[0x3];                       // 0x0009 (0x0003) ADDED PADDING
};

// ScriptStruct DishonoredGame.DisNativeStateTransitionLogic.StateTransitionLogicKey
// 0x0008
struct FStateTransitionLogicKey
{
	class UDishonoredNativeState*                      m_pFromClass;                                  // 0x0000 (0x0004) [0x0000000000000000]               
	class UDishonoredNativeState*                      m_pToClass;                                    // 0x0004 (0x0004) [0x0000000000000000]               
};

// ScriptStruct DishonoredGame.DishonoredNativeStateMachine.DisNativeFSMRejectedInfo
// 0x0014
struct FDisNativeFSMRejectedInfo
{
	class UDishonoredNativeState*                      m_pRejectedStateID;                            // 0x0000 (0x0004) [0x0000000000000000]               
	class UDishonoredNativeState*                      m_pStateThatRejectedID;                        // 0x0004 (0x0004) [0x0000000000000000]               
	uint8_t                                            m_RejectedReason;                              // 0x0008 (0x0001) [0x0000000000000000]               
	float                                              m_fTimeOfRejection;                            // 0x000C (0x0004) [0x0000000000000000]               
	int32_t                                            m_NumRejections;                               // 0x0010 (0x0004) [0x0000000000000000]               
};

// ScriptStruct DishonoredGame.DishonoredPlayerController.DisPossessionEffectSettings
// 0x000C
struct FDisPossessionEffectSettings
{
	uint8_t                                            m_Stage;                                       // 0x0000 (0x0001) [0x0000000000002000] (CPF_Transient)
	float                                              m_BlurAtExitStart;                             // 0x0004 (0x0004) [0x0000000000002000] (CPF_Transient)
	float                                              m_DistortAtExitStart;                          // 0x0008 (0x0004) [0x0000000000002000] (CPF_Transient)
};

// ScriptStruct DishonoredGame.DishonoredPlayerController.DisPlayerStealthAttentionIndicatorInfo
// 0x0014
struct FDisPlayerStealthAttentionIndicatorInfo
{
	float                                              m_fLastAttention;                              // 0x0000 (0x0004) [0x0000000000000000]               
	struct FDisLeakyAccumulator                        m_Accumulator;                                 // 0x0004 (0x0010) [0x0000000000000000]               
};

// ScriptStruct DishonoredGame.DishonoredPlayerController.DisPlayerViewTarget
// 0x0068
struct FDisPlayerViewTarget
{
	class AActor*                                      m_pTarget;                                     // 0x0000 (0x0004) [0x0000000000000000]               
	class USkeletalMeshComponent*                      m_pMesh;                                       // 0x0004 (0x0004) [0x0000000004080008] (CPF_ExportObject | CPF_Component | CPF_EditInline)
	class FName                                        m_LookBone;                                    // 0x0008 (0x0008) [0x0000000000000000]               
	struct FVector                                     m_LookBoneOffset;                              // 0x0010 (0x000C) [0x0000000000000000]               
	int32_t                                            m_StartRot;                                    // 0x001C (0x0004) [0x0000000000000000]               
	int32_t                                            m_TargetFixedRot;                              // 0x0020 (0x0004) [0x0000000000000000]               
	uint8_t                                            m_TrackType;                                   // 0x0024 (0x0001) [0x0000000000000000]               
	uint32_t                                           m_bHasCachedBonePos : 1;                       // 0x0028 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FVector                                     m_CachedBonePos;                               // 0x002C (0x000C) [0x0000000000000000]               
	int32_t                                            m_TrackID;                                     // 0x0038 (0x0004) [0x0000000000000000]               
	int32_t                                            m_Flags;                                       // 0x003C (0x0004) [0x0000000000000000]               
	float                                              m_fLimitRadius_Max;                            // 0x0040 (0x0004) [0x0000000000000000]               
	float                                              m_fLimitRadius_Min;                            // 0x0044 (0x0004) [0x0000000000000000]               
	int32_t                                            m_MaxPlayerControlledDelta;                    // 0x0048 (0x0004) [0x0000000000000000]               
	int32_t                                            m_PlayerControlledDelta_SoftenThreshold;       // 0x004C (0x0004) [0x0000000000000000]               
	int32_t                                            m_CurPlayerControlledDelta;                    // 0x0050 (0x0004) [0x0000000000000000]               
	int32_t                                            m_CurPlayerControlledDelta_Blended;            // 0x0054 (0x0004) [0x0000000000000000]               
	uint8_t                                            m_SoftenType;                                  // 0x0058 (0x0001) [0x0000000000000000]               
	float                                              m_fZoomFOVOverride;                            // 0x005C (0x0004) [0x0000000000000000]               
	float                                              m_fCurWeight;                                  // 0x0060 (0x0004) [0x0000000000000000]               
	float                                              m_fBlendSpeed;                                 // 0x0064 (0x0004) [0x0000000000000000]               
};

// ScriptStruct DishonoredGame.DishonoredPlayerController.DisPlayerViewTracking
// 0x00D4
struct FDisPlayerViewTracking
{
	struct FDisPlayerViewTarget                        m_ViewYawTarget;                               // 0x0000 (0x0068) [0x0000000000080000] (CPF_Component)
	struct FDisPlayerViewTarget                        m_ViewPitchTarget;                             // 0x0068 (0x0068) [0x0000000000080000] (CPF_Component)
	int32_t                                            m_CurTrackID;                                  // 0x00D0 (0x0004) [0x0000000000000000]               
};

// ScriptStruct DishonoredGame.DishonoredPlayerController.DisPlayerViewTracking_ExtraParams
// 0x0014
struct FDisPlayerViewTracking_ExtraParams
{
	float                                              m_fMaxRadius;                                  // 0x0000 (0x0004) [0x0000000000000000]               
	float                                              m_fMinRadius;                                  // 0x0004 (0x0004) [0x0000000000000000]               
	float                                              m_fMaxPlayerControlledDelta_Pitch;             // 0x0008 (0x0004) [0x0000000000000000]               
	float                                              m_fMaxPlayerControlledDelta_Yaw;               // 0x000C (0x0004) [0x0000000000000000]               
	float                                              m_fZoomFOVOverride;                            // 0x0010 (0x0004) [0x0000000000000000]               
};

// ScriptStruct DishonoredGame.DisTweaks_GFxMoviePlayerHUD.DisInteractionCrosshairSettings
// 0x000C
struct FDisInteractionCrosshairSettings
{
	class FName                                        m_Name;                                        // 0x0000 (0x0008) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           m_bShowDot : 1;                                // 0x0008 (0x0004) [0x0000000000000001] [0x00000001] (CPF_Edit)
};

// ScriptStruct DishonoredGame.DisTweaks_GFxMoviePlayerHUD.DisHUDMarkerVariation
// 0x0010
struct FDisHUDMarkerVariation
{
	float                                              m_StartDistance;                               // 0x0000 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              m_EndDistance;                                 // 0x0004 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              m_StartValue;                                  // 0x0008 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              m_EndValue;                                    // 0x000C (0x0004) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct DishonoredGame.DisTweaks_GFxMoviePlayerHUD.DisHUDMarkerSettings
// 0x0048
struct FDisHUDMarkerSettings
{
	class FString                                      m_SymbolName;                                  // 0x0000 (0x000C) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	struct FVector2D                                   m_BBMin;                                       // 0x000C (0x0008) [0x0000000000000001] (CPF_Edit)    
	struct FVector2D                                   m_BBMax;                                       // 0x0014 (0x0008) [0x0000000000000001] (CPF_Edit)    
	float                                              m_fWorldOffsetZ;                               // 0x001C (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              m_fScreenOffsetZ;                              // 0x0020 (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           m_bCanFocus : 1;                               // 0x0024 (0x0004) [0x0000000000000001] [0x00000001] (CPF_Edit)
	uint32_t                                           m_bKeepBBInMarkerArea : 1;                     // 0x0024 (0x0004) [0x0000000000000001] [0x00000002] (CPF_Edit)
	struct FDisHUDMarkerVariation                      m_ScaleVariation;                              // 0x0028 (0x0010) [0x0000000000000001] (CPF_Edit)    
	struct FDisHUDMarkerVariation                      m_AlphaVariation;                              // 0x0038 (0x0010) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct DishonoredGame.DisTweaks_GFxMoviePlayerHUD.DisTaskMarkerSettings
// 0x0028
struct FDisTaskMarkerSettings
{
	uint32_t                                           m_bShowDistance : 1;                           // 0x0000 (0x0004) [0x0000000000000001] [0x00000001] (CPF_Edit)
	struct FDisHUDMarkerVariation                      m_VanishPreset_VeryClose;                      // 0x0004 (0x0010) [0x0000000000000001] (CPF_Edit)    
	struct FDisHUDMarkerVariation                      m_VanishPreset_Never;                          // 0x0014 (0x0010) [0x0000000000000001] (CPF_Edit)    
	float                                              m_fOpacityReductionInCombat;                   // 0x0024 (0x0004) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct DishonoredGame.DisTweaks_GFxMoviePlayerHUD.DisAwarenessMarkerSettings
// 0x002C
struct FDisAwarenessMarkerSettings
{
	float                                              m_fDisplay_PlayerProxyMaxDist;                 // 0x0000 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              m_fDisplay_NPCMaxDist_Vision;                  // 0x0004 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              m_fDisplay_NPCMaxDist_NoVision;                // 0x0008 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              m_fFadeOutDelay_InitiallyHidden;               // 0x000C (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              m_fFadeOutDelay_NowHidden;                     // 0x0010 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              m_fFadeOutAnimDuration;                        // 0x0014 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              m_fMinScaleOutsideFOV;                         // 0x0018 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              m_fMaxScaleOutsideFOV;                         // 0x001C (0x0004) [0x0000000000000001] (CPF_Edit)    
	class TArray<uint8_t>                              m_AllowedAIAwareness;                          // 0x0020 (0x000C) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
};

// ScriptStruct DishonoredGame.DisTweaks_GFxMoviePlayerHUD.DisHeartTargetMarkerSettings
// 0x0008
struct FDisHeartTargetMarkerSettings
{
	uint32_t                                           m_bShowDistance : 1;                           // 0x0000 (0x0004) [0x0000000000000001] [0x00000001] (CPF_Edit)
	float                                              m_fOpacityReductionInCombat;                   // 0x0004 (0x0004) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct DishonoredGame.DisGFxMoviePlayerHUD.DisTaskPopupInfo
// 0x0005
struct FDisTaskPopupInfo
{
	class UDishonoredTask_Base*                        m_pTask;                                       // 0x0000 (0x0004) [0x0000000000000000]               
	uint8_t                                            m_Event;                                       // 0x0004 (0x0001) [0x0000000000000000]               
	uint8_t                                            MinStructAlignment[0x3];                       // 0x0005 (0x0003) ADDED PADDING
};

// ScriptStruct DishonoredGame.DisGFxMoviePlayerHUD.DisObjectivePopupInfo
// 0x0018
struct FDisObjectivePopupInfo
{
	class UDishonoredObjective*                        m_pObjective;                                  // 0x0000 (0x0004) [0x0000000000000000]               
	uint8_t                                            m_Event;                                       // 0x0004 (0x0001) [0x0000000000000000]               
	class TArray<struct FDisTaskPopupInfo>             m_Tasks;                                       // 0x0008 (0x000C) [0x0000000000500000] (CPF_NeedCtorLink)
	class UDisSeqAct_ShowTargetNotification*           m_pTargetNotifSeq;                             // 0x0014 (0x0004) [0x0000000000000000]               
};

// ScriptStruct DishonoredGame.DisGFxMoviePlayerHUD.DisHUDDamageInfo
// 0x0018
struct FDisHUDDamageInfo
{
	int32_t                                            m_Damage;                                      // 0x0000 (0x0004) [0x0000000000000000]               
	struct FVector                                     m_Momentum;                                    // 0x0004 (0x000C) [0x0000000000000000]               
	class AActor*                                      m_pDamageCauser;                               // 0x0010 (0x0004) [0x0000000000000000]               
	class ADishonoredPawn*                             m_pInstigator;                                 // 0x0014 (0x0004) [0x0000000000000000]               
};

// ScriptStruct DishonoredGame.DisGFxMoviePlayerHUD.DisUIInteractionProbe
// 0x000B
struct FDisUIInteractionProbe
{
	uint8_t                                            m_bCanAssassinate;                             // 0x0000 (0x0001) [0x0000000000000000]               
	uint32_t                                           m_bCanDropAssassinate : 1;                     // 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
	uint8_t                                            m_bCanAdrenalineKill;                          // 0x0008 (0x0001) [0x0000000000000000]               
	uint8_t                                            m_bCanMantle;                                  // 0x0009 (0x0001) [0x0000000000000000]               
	uint8_t                                            m_bCanChoke;                                   // 0x000A (0x0001) [0x0000000000000000]               
	uint8_t                                            MinStructAlignment[0x1];                       // 0x000B (0x0001) ADDED PADDING
};

// ScriptStruct DishonoredGame.DisGFxMoviePlayerHUD.DisUIInteraction
// 0x0008
struct FDisUIInteraction
{
	uint8_t                                            m_Index;                                       // 0x0000 (0x0001) [0x0000000000000000]               
	struct FPointer                                    m_pText;                                       // 0x0004 (0x0004) [0x0000000000001000] (CPF_Native)  
};

// ScriptStruct DishonoredGame.DisGFxMoviePlayerHUD.DisUIInteractionGroup
// 0x0024
struct FDisUIInteractionGroup
{
	struct FDisUIInteraction                           m_Interactions[4];                             // 0x0000 (0x0020) [0x0000000000000000]               
	int32_t                                            m_InteractionCount;                            // 0x0020 (0x0004) [0x0000000000000000]               
};

// ScriptStruct DishonoredGame.DisGFxMoviePlayerHUD.DisUIInteractionContext
// 0x0090
struct FDisUIInteractionContext
{
	struct FDisUIInteractionGroup                      m_Groups[4];                                   // 0x0000 (0x0090) [0x0000000000000000]               
};

// ScriptStruct DishonoredGame.DisGFxMoviePlayerHUD.DisPlayerStatus_Equipment
// 0x0014
struct FDisPlayerStatus_Equipment
{
	struct FPointer                                    m_pItem;                                       // 0x0000 (0x0004) [0x0000000000001000] (CPF_Native)  
	uint8_t                                            m_Item;                                        // 0x0004 (0x0001) [0x0000000000000000]               
	uint32_t                                           m_bPowerActive : 1;                            // 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           m_bPowerHasMana : 1;                           // 0x0008 (0x0004) [0x0000000000000000] [0x00000002] 
	int32_t                                            m_AmmoTotal;                                   // 0x000C (0x0004) [0x0000000000000000]               
	int32_t                                            m_LoadedAmmoCount;                             // 0x0010 (0x0004) [0x0000000000000000]               
};

// ScriptStruct DishonoredGame.DisGFxMoviePlayerHUD.DisPlayerStatus_Mana
// 0x0010
struct FDisPlayerStatus_Mana
{
	int32_t                                            m_Mana;                                        // 0x0000 (0x0004) [0x0000000000000000]               
	int32_t                                            m_ManaRegen;                                   // 0x0004 (0x0004) [0x0000000000000000]               
	int32_t                                            m_ManaMax;                                     // 0x0008 (0x0004) [0x0000000000000000]               
	uint32_t                                           m_bVisible : 1;                                // 0x000C (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           m_bAvailable : 1;                              // 0x000C (0x0004) [0x0000000000000000] [0x00000002] 
	uint32_t                                           m_bHasUpgrade : 1;                             // 0x000C (0x0004) [0x0000000000000000] [0x00000004] 
};

// ScriptStruct DishonoredGame.DisGFxMoviePlayerHUD.DisPlayerStatus_Health
// 0x0010
struct FDisPlayerStatus_Health
{
	int32_t                                            m_Health;                                      // 0x0000 (0x0004) [0x0000000000000000]               
	int32_t                                            m_HealthRegen;                                 // 0x0004 (0x0004) [0x0000000000000000]               
	int32_t                                            m_HealthMax;                                   // 0x0008 (0x0004) [0x0000000000000000]               
	uint32_t                                           m_bHasSmallUpgrade : 1;                        // 0x000C (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           m_bHasLargeUpgrade : 1;                        // 0x000C (0x0004) [0x0000000000000000] [0x00000002] 
};

// ScriptStruct DishonoredGame.DisGFxMoviePlayerHUD.DisCrosshairSettings
// 0x000C
struct FDisCrosshairSettings
{
	class FName                                        m_Name;                                        // 0x0000 (0x0008) [0x0000000000004000] (CPF_Config)  
	uint32_t                                           m_bShowDot : 1;                                // 0x0008 (0x0004) [0x0000000000004000] [0x00000001] (CPF_Config)
	uint32_t                                           m_bSupportsDispersion : 1;                     // 0x0008 (0x0004) [0x0000000000004000] [0x00000002] (CPF_Config)
};

// ScriptStruct DishonoredGame.DisGFxMoviePlayerHUD.DisHUDSettings
// 0x0014
struct FDisHUDSettings
{
	uint8_t                                            m_HUDVisibility;                               // 0x0000 (0x0001) [0x0000000000000000]               
	uint32_t                                           m_bShowObjectivePopups : 1;                    // 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           m_bShowTutorialNotifications : 1;              // 0x0004 (0x0004) [0x0000000000000000] [0x00000002] 
	uint32_t                                           m_bShowInteractions : 1;                       // 0x0004 (0x0004) [0x0000000000000000] [0x00000004] 
	uint32_t                                           m_bShowHighlight : 1;                          // 0x0004 (0x0004) [0x0000000000000000] [0x00000008] 
	uint32_t                                           m_bShowPickupLog : 1;                          // 0x0004 (0x0004) [0x0000000000000000] [0x00000010] 
	uint32_t                                           m_bShowContextualIcons : 1;                    // 0x0004 (0x0004) [0x0000000000000000] [0x00000020] 
	uint32_t                                           m_bShowPlayerStance : 1;                       // 0x0004 (0x0004) [0x0000000000000000] [0x00000040] 
	uint32_t                                           m_bShowObjectiveMarkers : 1;                   // 0x0004 (0x0004) [0x0000000000000000] [0x00000080] 
	uint32_t                                           m_bShowGrenadeMarkers : 1;                     // 0x0004 (0x0004) [0x0000000000000000] [0x00000100] 
	uint32_t                                           m_bShowAwarenessMarkers : 1;                   // 0x0004 (0x0004) [0x0000000000000000] [0x00000200] 
	uint32_t                                           m_bShowHeartTargetMarkers : 1;                 // 0x0004 (0x0004) [0x0000000000000000] [0x00000400] 
	uint8_t                                            m_CrosshairStyle;                              // 0x0008 (0x0001) [0x0000000000000000]               
	uint32_t                                           m_bCrosshairMovement : 1;                      // 0x000C (0x0004) [0x0000000000000000] [0x00000001] 
	float                                              m_fCrosshairOpacity;                           // 0x0010 (0x0004) [0x0000000000000000]               
};

// ScriptStruct DishonoredGame.DisGFxMoviePlayerJournal.DisObjectiveListItem
// 0x000C
struct FDisObjectiveListItem
{
	class UDishonoredObjective*                        m_pObjective;                                  // 0x0000 (0x0004) [0x0000000000000000]               
	class UDishonoredTask_Base*                        m_pTask;                                       // 0x0004 (0x0004) [0x0000000000000000]               
	uint32_t                                           m_bActive : 1;                                 // 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct DishonoredGame.DisGFxMoviePlayerJournal.DisJournalItem
// 0x001C
struct FDisJournalItem
{
	struct FPointer                                    m_pName;                                       // 0x0000 (0x0004) [0x0000000000001000] (CPF_Native)  
	int32_t                                            m_Quantity;                                    // 0x0004 (0x0004) [0x0000000000000000]               
	uint8_t                                            m_Section;                                     // 0x0008 (0x0001) [0x0000000000000000]               
	struct FPointer                                    m_pIconName;                                   // 0x000C (0x0004) [0x0000000000001000] (CPF_Native)  
	struct FPointer                                    m_pStaticDescription;                          // 0x0010 (0x0004) [0x0000000000001000] (CPF_Native)  
	struct FPointer                                    m_pAbstractItem;                               // 0x0014 (0x0004) [0x0000000000001000] (CPF_Native)  
	int32_t                                            m_Flags;                                       // 0x0018 (0x0004) [0x0000000000000000]               
};

// ScriptStruct DishonoredGame.DisGFxMoviePlayerJournal.DisJournalPowerSlot
// 0x0024
struct FDisJournalPowerSlot
{
	uint8_t                                            m_SelectionType;                               // 0x0000 (0x0001) [0x0000000000004000] (CPF_Config)  
	class FString                                      m_PowerId;                                     // 0x0004 (0x000C) [0x0000000000404000] (CPF_Config | CPF_NeedCtorLink)
	class FString                                      m_BackgroundImagePath;                         // 0x0010 (0x000C) [0x0000000000404000] (CPF_Config | CPF_NeedCtorLink)
	uint8_t                                            m_Note;                                        // 0x001C (0x0001) [0x0000000000004000] (CPF_Config)  
	uint32_t                                           m_bNoteRead : 1;                               // 0x0020 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct DishonoredGame.DishonoredPawn.DisCachedPositionInfo
// 0x001C
struct FDisCachedPositionInfo
{
	float                                              m_CachedPositionTimeStamp;                     // 0x0000 (0x0004) [0x0000000000000000]               
	struct FVector                                     m_CachedPosition;                              // 0x0004 (0x000C) [0x0000000000000000]               
	struct FVector                                     m_CachedVelocity;                              // 0x0010 (0x000C) [0x0000000000000000]               
};

// ScriptStruct DishonoredGame.DishonoredInventory.PawnInventorySlot
// 0x0009
struct FPawnInventorySlot
{
	class UDishonoredInventoryItem*                    m_pItem;                                       // 0x0000 (0x0004) [0x0000000000000000]               
	class UDishonoredInventoryItem*                    m_pRequiredType;                               // 0x0004 (0x0004) [0x0000000000000000]               
	uint8_t                                            m_RequiredUsage;                               // 0x0008 (0x0001) [0x0000000000000000]               
	uint8_t                                            MinStructAlignment[0x3];                       // 0x0009 (0x0003) ADDED PADDING
};

// ScriptStruct DishonoredGame.DishonoredInventory.DisAmmoInfo
// 0x0008
struct FDisAmmoInfo
{
	int32_t                                            m_AmmoCount;                                   // 0x0000 (0x0004) [0x0000000000000000]               
	int32_t                                            m_AmmoCapacity;                                // 0x0004 (0x0004) [0x0000000000000000]               
};

// ScriptStruct DishonoredGame.DishonoredInventory.DisEquipUsageInfo
// 0x0028
struct FDisEquipUsageInfo
{
	int32_t                                            m_iEquippedSlot;                               // 0x0000 (0x0004) [0x0000000000002000] (CPF_Transient)
	int32_t                                            m_iReequipSlot;                                // 0x0004 (0x0004) [0x0000000000002000] (CPF_Transient)
	int32_t                                            m_iReequipSlotNonEmpty;                        // 0x0008 (0x0004) [0x0000000000002000] (CPF_Transient)
	int32_t                                            m_iDropSlot_NextFrame;                         // 0x000C (0x0004) [0x0000000000002000] (CPF_Transient)
	struct FVector                                     m_VelocitySupplement;                          // 0x0010 (0x000C) [0x0000000000002000] (CPF_Transient)
	struct FVector                                     m_RotationSupplement;                          // 0x001C (0x000C) [0x0000000000002000] (CPF_Transient)
};

// ScriptStruct DishonoredGame.DishonoredPawn.PawnDodgeTarget
// 0x0014
struct FPawnDodgeTarget
{
	class ADishonoredPawn*                             m_pAttacker;                                   // 0x0000 (0x0004) [0x0000000000000000]               
	class UDisItemContext*                             m_pAttackContext;                              // 0x0004 (0x0004) [0x0000000000000000]               
	uint8_t                                            m_DodgeDir;                                    // 0x0008 (0x0001) [0x0000000000000000]               
	uint32_t                                           m_bDidDodge : 1;                               // 0x000C (0x0004) [0x0000000000000000] [0x00000001] 
	int32_t                                            m_TrackID;                                     // 0x0010 (0x0004) [0x0000000000000000]               
};

// ScriptStruct DishonoredGame.DishonoredPawn.DisVulnerableInfo
// 0x0014
struct FDisVulnerableInfo
{
	struct FDisZoneTracker                             m_Zone;                                        // 0x0000 (0x000C) [0x0000000000000000]               
	float                                              m_fExtraVulnerableTime;                        // 0x000C (0x0004) [0x0000000000000000]               
	float                                              m_fTimeOfLastExit;                             // 0x0010 (0x0004) [0x0000000000000000]               
};

// ScriptStruct DishonoredGame.DishonoredPawn.DisFootInfo
